[
  {
    "equipment" : "barbell",
    "target" : "pectorals",
    "id" : "0025",
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3WxnjNr2oi3-Ct",
    "name" : "barbell bench press",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell slowly towards your chest, keeping your elbows tucked in.",
      "Pause for a moment when the barbell touches your chest.",
      "Push the barbell back up to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "equipment" : "barbell",
    "name" : "barbell bent over row",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Bend forward at the hips while keeping your back straight and chest up.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Pull the barbell towards your lower chest by retracting your shoulder blades and squeezing your back muscles.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0027",
    "bodyPart" : "back",
    "target" : "upper back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/tHlEPYxrUUskGd"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/xogU9WfOj-Ip8j",
    "id" : "0028",
    "bodyPart" : "upper legs",
    "target" : "quads",
    "secondaryMuscles" : [
      "hamstrings",
      "glutes",
      "shoulders",
      "triceps"
    ],
    "name" : "barbell clean and press",
    "instructions" : [
      "Stand with your feet shoulder-width apart and the barbell on the floor in front of you.",
      "Bend your knees and hinge at the hips to lower down and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Drive through your heels and extend your hips and knees to lift the barbell off the floor, keeping it close to your body.",
      "As the barbell reaches your thighs, explosively extend your hips, shrug your shoulders, and pull the barbell up towards your chest.",
      "As the barbell reaches chest height, quickly drop under it and catch it at shoulder level, with your elbows pointing forward and your palms facing up.",
      "From the catch position, press the barbell overhead by extending your arms and pushing the barbell straight up.",
      "Lower the barbell back down to the starting position and repeat for the desired number of repetitions."
    ],
    "equipment" : "barbell"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/PSDJp2u-AvJbbC",
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves",
      "core"
    ],
    "id" : "0029",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart and the barbell resting on your upper chest, with your elbows pointing forward.",
      "Lower your body by bending your knees and pushing your hips back, as if you are sitting back into a chair.",
      "Keep your chest up and your back straight as you lower down, making sure your knees do not go past your toes.",
      "Continue lowering until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Pause for a moment at the bottom, then push through your heels to stand back up, extending your hips and knees.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "barbell",
    "target" : "glutes",
    "name" : "barbell clean-grip front squat"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/I5XOUen5TuIcPd",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with a close grip, slightly narrower than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows close to your body.",
      "Pause for a moment when the barbell touches your chest.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "id" : "0030",
    "equipment" : "barbell",
    "target" : "triceps",
    "name" : "barbell close-grip bench press"
  },
  {
    "id" : "0031",
    "target" : "biceps",
    "equipment" : "barbell",
    "name" : "barbell curl",
    "bodyPart" : "upper arms",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold a barbell with an underhand grip, palms facing forward.",
      "Keep your elbows close to your torso and exhale as you curl the weights while contracting your biceps.",
      "Continue to raise the bar until your biceps are fully contracted and the bar is at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale as you slowly begin to lower the bar back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vsJo5oyMqRP9gQ"
  },
  {
    "target" : "glutes",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vKppxFRk4yhEaP",
    "instructions" : [
      "Stand with your feet shoulder-width apart and the barbell on the ground in front of you.",
      "Bend your knees and hinge at the hips to lower your torso and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Keep your back straight and chest lifted as you drive through your heels to lift the barbell off the ground, extending your hips and knees.",
      "As you stand up straight, squeeze your glutes and keep your core engaged.",
      "Lower the barbell back down to the ground by bending at the hips and knees, keeping your back straight.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0032",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "name" : "barbell deadlift"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wBgvFUsNFEO0Wd",
    "target" : "pectorals",
    "name" : "barbell decline bench press",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "bodyPart" : "chest",
    "equipment" : "barbell",
    "instructions" : [
      "Lie on a decline bench with your feet secured and your head lower than your hips.",
      "Grasp the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows tucked in.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0033"
  },
  {
    "equipment" : "barbell",
    "bodyPart" : "lower legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Rr2Fmjc-xzczNR",
    "id" : "1370",
    "target" : "calves",
    "secondaryMuscles" : [
      "hamstrings"
    ],
    "instructions" : [
      "Place a barbell on the floor in front of you.",
      "Stand with the balls of your feet on the edge of the barbell, with your heels hanging off.",
      "Hold onto a stable object for balance if needed.",
      "Raise your heels as high as possible, using your calves to lift your body.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell floor calf raise"
  },
  {
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/xw90njqTRPEaXt",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves",
      "core"
    ],
    "name" : "barbell front chest squat",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the barbell in front of your chest with your hands shoulder-width apart, elbows pointing forward.",
      "Engage your core and keep your chest up as you lower your body down into a squat position, pushing your hips back and bending your knees.",
      "Lower until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "glutes",
    "id" : "0039"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a barbell in front of your thighs with an overhand grip.",
      "Keep your arms straight and lift the barbell forward and upward until it reaches shoulder level.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/dRAI1IywYwVoDj",
    "secondaryMuscles" : [
      "biceps",
      "triceps"
    ],
    "equipment" : "barbell",
    "name" : "barbell front raise",
    "id" : "0041",
    "target" : "delts"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/d23sZ8vmmJ-5dI",
    "id" : "0040",
    "bodyPart" : "chest",
    "equipment" : "barbell",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "deltoids",
      "triceps"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a barbell with an overhand grip, palms facing down.",
      "Keep your arms straight and raise the barbell in front of you until it reaches shoulder height.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
      "Next, lower the barbell behind your head, keeping your arms straight.",
      "Pause for a moment at the bottom, then raise the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell front raise and pullover"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/OG6EtWx1--6ORV",
    "bodyPart" : "upper legs",
    "equipment" : "barbell",
    "id" : "0042",
    "name" : "barbell front squat",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the barbell in front of your shoulders, resting it on your collarbone and shoulders.",
      "Engage your core and keep your chest up as you lower your body down into a squat position, pushing your hips back and bending your knees.",
      "Lower until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "glutes",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves",
      "core"
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/5ITxKLko0l7fFq",
    "name" : "barbell full squat",
    "bodyPart" : "upper legs",
    "equipment" : "barbell",
    "target" : "glutes",
    "id" : "0043",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves",
      "core"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the barbell across your upper back, resting it on your traps or rear delts.",
      "Engage your core and keep your chest up as you begin to lower your body down.",
      "Bend at the knees and hips, pushing your hips back and down as if sitting into a chair.",
      "Lower yourself until your thighs are parallel to the ground or slightly below.",
      "Keep your knees in line with your toes and your weight in your heels.",
      "Drive through your heels to stand back up, extending your hips and knees.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/25pe7PsXcCDAKG",
    "equipment" : "barbell",
    "name" : "barbell incline bench press",
    "target" : "pectorals",
    "instructions" : [
      "Set up an incline bench at a 45-degree angle.",
      "Lie down on the bench with your feet flat on the ground.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows at a 45-degree angle.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0047",
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ]
  },
  {
    "bodyPart" : "upper arms",
    "instructions" : [
      "Set up an incline bench at a 45-degree angle.",
      "Lie down on the bench with your feet flat on the ground.",
      "Grasp the barbell with a close grip, slightly narrower than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows close to your body.",
      "Pause for a moment when the barbell touches your chest.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell incline close grip bench press",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "target" : "triceps",
    "equipment" : "barbell",
    "id" : "1719",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/je5sBBxc4wty8G"
  },
  {
    "bodyPart" : "chest",
    "secondaryMuscles" : [
      "deltoids",
      "trapezius"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/quet-S059AbOCE",
    "equipment" : "barbell",
    "name" : "barbell incline shoulder raise",
    "instructions" : [
      "Set up an incline bench at a 45-degree angle.",
      "Sit on the bench with your back against the pad and feet flat on the ground.",
      "Hold a barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Lift the barbell up to shoulder height, keeping your elbows slightly bent.",
      "Slowly raise the barbell overhead, extending your arms fully.",
      "Pause for a moment at the top, then slowly lower the barbell back to shoulder height.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "serratus anterior",
    "id" : "0050"
  },
  {
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "equipment" : "barbell",
    "instructions" : [
      "Stand with your feet shoulder-width apart and toes slightly turned out.",
      "Hold the barbell with an overhand grip, resting it on the front of your body, just below your waist.",
      "Step your left foot forward and your right foot back, keeping your feet shoulder-width apart.",
      "Bend your knees and lower your body down into a squat position, keeping your back straight and chest up.",
      "Push through your heels to stand back up to the starting position.",
      "Repeat the movement, alternating your forward and back foot with each repetition."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/FeFzknzNJA3ueL",
    "target" : "glutes",
    "id" : "0051",
    "name" : "barbell jefferson squat"
  },
  {
    "equipment" : "barbell",
    "id" : "0053",
    "target" : "glutes",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ZjLZQcRMmYrpPY",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart, holding a barbell across your upper back.",
      "Lower your body into a squat position by bending your knees and pushing your hips back.",
      "Once you reach the bottom of the squat, explode upwards by jumping off the ground.",
      "As you jump, extend your hips, knees, and ankles, pushing through your toes.",
      "Land softly back into the squat position and immediately repeat the movement for the desired number of repetitions."
    ],
    "name" : "barbell jump squat"
  },
  {
    "target" : "glutes",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a barbell across your upper back.",
      "Take a big step to the side with your right foot, keeping your left foot planted.",
      "Bend your right knee and lower your body down into a lunge position, keeping your left leg straight.",
      "Push off with your right foot and return to the starting position.",
      "Repeat on the other side, stepping with your left foot."
    ],
    "name" : "barbell lateral lunge",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/LAI2qb4ShmRsKL",
    "id" : "1410",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ]
  },
  {
    "name" : "barbell low bar squat",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet shoulder-width apart and the barbell resting on your upper back.",
      "Keeping your chest up and core engaged, slowly lower your body by bending your knees and pushing your hips back.",
      "Continue lowering until your thighs are parallel to the ground or slightly below.",
      "Pause for a moment, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "glutes",
    "id" : "1435",
    "equipment" : "barbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/jFW4TsLtos0SDU",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ]
  },
  {
    "equipment" : "barbell",
    "name" : "barbell lunge",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart and a barbell resting on your upper back.",
      "Take a step forward with your right foot, keeping your torso upright.",
      "Lower your body by bending your right knee until your thigh is parallel to the ground.",
      "Push through your right heel to return to the starting position.",
      "Repeat with your left leg, alternating legs for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/XX4oZcfF--wFEw",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "target" : "glutes",
    "id" : "0054",
    "bodyPart" : "upper legs"
  },
  {
    "instructions" : [
      "Sit on a preacher bench with your upper arms resting on the pad and your chest against the support.",
      "Grasp the barbell with an underhand grip, slightly wider than shoulder-width apart.",
      "Keeping your upper arms stationary, exhale and curl the barbell up towards your shoulders.",
      "Pause for a moment at the top, squeezing your biceps.",
      "Inhale and slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell preacher curl",
    "target" : "biceps",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Inb1H5qZ2TidoC",
    "equipment" : "barbell",
    "id" : "0070",
    "secondaryMuscles" : [
      "forearms"
    ]
  },
  {
    "equipment" : "barbell",
    "target" : "delts",
    "id" : "0075",
    "name" : "barbell rear delt raise",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ELChnGgCJ869wa",
    "secondaryMuscles" : [
      "traps",
      "rhomboids"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a barbell with an overhand grip, palms facing down.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Raise the barbell out to the sides, keeping your arms straight, until they are parallel to the ground.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Hold a barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Bend forward at the hips, keeping your back straight and chest up.",
      "Pull the barbell towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pgpp6eOkWAy--p",
    "target" : "delts",
    "equipment" : "barbell",
    "name" : "barbell rear delt row",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids",
      "biceps"
    ],
    "id" : "0076"
  },
  {
    "bodyPart" : "upper legs",
    "name" : "barbell rear lunge",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "id" : "0078",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart and a barbell resting on your upper back.",
      "Take a step backward with your right foot, landing on the ball of your foot.",
      "Bend both knees to lower your body until your left thigh is parallel to the ground.",
      "Push through your left heel to return to the starting position.",
      "Repeat with the other leg."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/YdaSuwP0Ps4HXK",
    "target" : "glutes",
    "equipment" : "barbell"
  },
  {
    "equipment" : "barbell",
    "bodyPart" : "upper arms",
    "id" : "0080",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "barbell reverse curl",
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold a barbell with an overhand grip, palms facing down.",
      "Keep your upper arms stationary and exhale as you curl the barbell upward, contracting your biceps.",
      "Continue to raise the barbell until your biceps are fully contracted and the barbell is at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale as you slowly lower the barbell back to the starting position, keeping your upper arms stationary.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "biceps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7T1OIGWZOMFSUX"
  },
  {
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your head at the end of the bench.",
      "Hold the barbell with a reverse grip, palms facing towards your face, and your hands shoulder-width apart.",
      "Extend your arms straight up over your chest, keeping your elbows in and your wrists straight.",
      "Slowly lower the barbell towards your forehead by bending your elbows, keeping your upper arms stationary.",
      "Pause for a moment at the bottom, then extend your arms back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "barbell",
    "name" : "barbell reverse grip skullcrusher",
    "target" : "triceps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/-vUMCNv4T7U6uD",
    "id" : "1721",
    "bodyPart" : "upper arms"
  },
  {
    "secondaryMuscles" : [
      "lower back"
    ],
    "equipment" : "barbell",
    "bodyPart" : "waist",
    "name" : "barbell rollerout",
    "target" : "abs",
    "instructions" : [
      "Kneel on the floor and hold a barbell with both hands, shoulder-width apart.",
      "Roll the barbell forward, extending your arms and keeping your core engaged.",
      "Continue rolling forward until your body is fully extended and your arms are overhead.",
      "Pause for a moment, then slowly roll the barbell back towards your knees, maintaining control.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TKj5V2NLvWHJpX",
    "id" : "0084"
  },
  {
    "id" : "0085",
    "bodyPart" : "upper legs",
    "target" : "glutes",
    "equipment" : "barbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/mftX-fMB4NKBwr",
    "name" : "barbell romanian deadlift",
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and your toes pointing forward.",
      "Hold the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Bend at the hips, keeping your back straight and your knees slightly bent.",
      "Lower the barbell towards the ground, keeping it close to your body.",
      "Feel the stretch in your hamstrings as you lower the barbell.",
      "Once you feel a stretch in your hamstrings, push your hips forward and stand up straight.",
      "Squeeze your glutes at the top of the movement.",
      "Lower the barbell back down to the starting position and repeat for the desired number of repetitions."
    ]
  },
  {
    "instructions" : [
      "Sit on a bench with your back straight and feet flat on the ground.",
      "Hold the barbell with a close grip behind your neck, palms facing forward.",
      "Keep your elbows close to your head and slowly lower the barbell towards the back of your head.",
      "Pause for a moment, then extend your arms back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "triceps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Pfx-RwLgxBZ2bG",
    "id" : "1718",
    "name" : "barbell seated close grip behind neck triceps extension",
    "equipment" : "barbell",
    "bodyPart" : "upper arms",
    "secondaryMuscles" : [
      "shoulders"
    ]
  },
  {
    "name" : "barbell seated close-grip concentration curl",
    "equipment" : "barbell",
    "target" : "biceps",
    "secondaryMuscles" : [
      "forearms"
    ],
    "id" : "0089",
    "instructions" : [
      "Sit on a bench with your feet flat on the floor and hold a barbell with an underhand grip, hands shoulder-width apart.",
      "Rest your upper arms against your inner thighs, just above your knees, and let the barbell hang down in front of you.",
      "Keeping your upper arms stationary, exhale and curl the barbell up towards your shoulders, contracting your biceps.",
      "Hold the contracted position for a brief pause, then inhale and slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/RuetVNmcThfBpi",
    "bodyPart" : "upper arms"
  },
  {
    "target" : "traps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/f9CmVGWeh-APsm",
    "bodyPart" : "back",
    "equipment" : "barbell",
    "id" : "0095",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a barbell in front of you with an overhand grip.",
      "Keep your arms straight and your back straight throughout the exercise.",
      "Lift your shoulders up towards your ears as high as possible, squeezing your traps at the top.",
      "Hold for a moment, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell shrug"
  },
  {
    "id" : "2798",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/4oGdIYWqe6VY1i",
    "instructions" : [
      "Start by standing with your feet shoulder-width apart, holding a barbell across your upper back.",
      "Lower your body into a squat position by bending your knees and pushing your hips back.",
      "Explode upwards, jumping off the ground as high as you can.",
      "Land softly on your feet and immediately step back with one leg into a reverse lunge.",
      "Lower your body down until your front thigh is parallel to the ground, keeping your back straight.",
      "Push through your front heel to return to the starting position.",
      "Repeat the jump and lunge sequence on the other leg.",
      "Continue alternating legs for the desired number of repetitions."
    ],
    "target" : "quads",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "glutes",
      "hamstrings",
      "calves"
    ],
    "name" : "barbell squat jump step rear lunge"
  },
  {
    "bodyPart" : "lower arms",
    "target" : "forearms",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "biceps",
      "shoulders"
    ],
    "id" : "0104",
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold a barbell with an overhand grip.",
      "Rest the barbell on the back of your hands with your palms facing down and your fingers pointing towards your body.",
      "Keeping your upper arms stationary, exhale and curl your wrists upwards as far as possible.",
      "Hold the contracted position for a brief pause, then inhale and slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell standing back wrist curl",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/WCit3g5Cqxk2tB"
  },
  {
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ],
    "name" : "barbell standing calf raise",
    "equipment" : "barbell",
    "instructions" : [
      "Stand with your feet shoulder-width apart and place a barbell across your upper back.",
      "Raise your heels off the ground as high as possible, using only your toes.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "1372",
    "bodyPart" : "lower legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/CD7NQdEC4zmeeC",
    "target" : "calves"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/zYvnqBPQDK0i0F",
    "target" : "delts",
    "name" : "barbell standing front raise over head",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "id" : "0107",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a barbell in front of your thighs with an overhand grip.",
      "Keep your back straight and engage your core.",
      "Slowly raise the barbell in front of you, keeping your arms straight and your palms facing down.",
      "Continue lifting until the barbell is slightly above shoulder level.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders"
  },
  {
    "name" : "barbell standing leg calf raise",
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ],
    "equipment" : "barbell",
    "id" : "0108",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/p29ynSQu0MbtSY",
    "instructions" : [
      "Stand with your feet shoulder-width apart and place a barbell across your upper back.",
      "Raise your heels off the ground as high as possible, using your calves.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "lower legs",
    "target" : "calves"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a barbell with an overhand grip.",
      "Raise the barbell overhead, fully extending your arms.",
      "Keeping your upper arms close to your head, slowly lower the barbell behind your head by bending your elbows.",
      "Pause for a moment, then raise the barbell back to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0109",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/OOVSU6ISviDgy-",
    "target" : "triceps",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "equipment" : "barbell",
    "name" : "barbell standing overhead triceps extension"
  },
  {
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold a barbell with an underhand grip, palms facing up.",
      "Keep your elbows close to your torso and your upper arms stationary.",
      "Exhale and curl the weights while contracting your biceps, bringing the barbell as close to your shoulders as possible.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "barbell standing reverse grip curl",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Fvm2hoDiVdYFe2",
    "target" : "biceps",
    "equipment" : "barbell",
    "id" : "0110",
    "secondaryMuscles" : [
      "forearms"
    ],
    "bodyPart" : "upper arms"
  },
  {
    "target" : "glutes",
    "id" : "0117",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pw7zBu3yoBHPkd",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet wider than shoulder-width apart, toes pointing outwards.",
      "Place a barbell on the ground in front of you, centered between your feet.",
      "Bend your knees and lower your hips, keeping your back straight and chest up, to grip the barbell with an overhand grip.",
      "Engage your core and drive through your heels to lift the barbell off the ground, extending your hips and knees simultaneously.",
      "As you lift, keep your chest up and back straight, and push your hips forward to fully engage your glutes.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps",
      "lower back"
    ],
    "name" : "barbell sumo deadlift"
  },
  {
    "equipment" : "barbell",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ],
    "bodyPart" : "chest",
    "name" : "barbell wide bench press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/aocEStiXp8YD3t",
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with a wide grip, slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell slowly towards your chest, keeping your elbows slightly flared out.",
      "Pause for a moment when the barbell touches your chest, then push it back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0122"
  },
  {
    "id" : "1770",
    "instructions" : [
      "Sit on a bench with your legs spread apart and your feet flat on the ground.",
      "Hold a dumbbell in one hand and place your elbow on the inside of your thigh, just above the knee.",
      "With your palm facing up, curl the dumbbell towards your shoulder while keeping your upper arm stationary.",
      "Squeeze your biceps at the top of the movement, then slowly lower the dumbbell back to the starting position.",
      "Repeat for the desired number of repetitions, then switch arms."
    ],
    "target" : "biceps",
    "equipment" : "body weight",
    "secondaryMuscles" : [
      "forearms"
    ],
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7rKjvVkvO1gj0j",
    "name" : "biceps leg concentration curl"
  },
  {
    "bodyPart" : "upper arms",
    "instructions" : [
      "Hang from a pull-up bar with your palms facing away from you and your hands shoulder-width apart.",
      "Engage your core and pull yourself up by bending your elbows, bringing your chest towards the bar.",
      "Pause at the top of the movement, then slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "biceps pull-up",
    "id" : "0140",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/V2xOhsEOoFeX7D",
    "target" : "biceps",
    "secondaryMuscles" : [
      "forearms",
      "shoulders"
    ],
    "equipment" : "body weight"
  },
  {
    "id" : "1160",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves",
      "shoulders",
      "chest"
    ],
    "bodyPart" : "cardio",
    "instructions" : [
      "Start in a standing position with your feet shoulder-width apart.",
      "Lower your body into a squat position by bending your knees and placing your hands on the floor in front of you.",
      "Kick your feet back into a push-up position.",
      "Perform a push-up, keeping your body in a straight line.",
      "Jump your feet back into the squat position.",
      "Jump up explosively, reaching your arms overhead.",
      "Land softly and immediately lower back into a squat position to begin the next repetition."
    ],
    "equipment" : "body weight",
    "name" : "burpee",
    "target" : "cardiovascular system",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/NzLkHsWeh5SjLb"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/UTpuaCE40K6iYs",
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ],
    "instructions" : [
      "Adjust the cable pulley to a high position and attach a straight bar.",
      "Sit facing the cable machine with your feet flat on the ground and your knees slightly bent.",
      "Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Lean back slightly and keep your chest up, maintaining a slight arch in your lower back.",
      "Pull the bar down towards your chest, leading with your elbows and squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly return the bar to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "id" : "0150",
    "target" : "lats",
    "name" : "cable bar lateral pulldown",
    "equipment" : "cable"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/CgeKtPN7HxHEb7",
    "instructions" : [
      "Adjust the cable machine to chest height and attach the handles.",
      "Stand facing away from the machine with your feet shoulder-width apart.",
      "Grasp the handles with an overhand grip and step forward to create tension in the cables.",
      "Position your feet firmly on the ground and engage your core.",
      "Bend your elbows and bring your hands to shoulder level, keeping your elbows at a 90-degree angle.",
      "Push the handles forward, extending your arms fully in front of you.",
      "Pause for a moment, then slowly reverse the movement, bringing your hands back to shoulder level.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "id" : "0151",
    "name" : "cable bench press",
    "target" : "pectorals",
    "equipment" : "cable",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ]
  },
  {
    "instructions" : [
      "Sit on a bench or chair with your feet flat on the floor and your knees slightly bent.",
      "Hold the cable handle with an underhand grip and rest your elbow against the inside of your thigh.",
      "Keeping your upper arm stationary, exhale and curl the cable handle towards your shoulder while contracting your biceps.",
      "Pause for a moment at the top of the movement, then inhale and slowly lower the cable handle back to the starting position.",
      "Repeat for the desired number of repetitions, then switch arms."
    ],
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "cable concentration curl",
    "id" : "1631",
    "equipment" : "cable",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vHo2y8fgWXPcpY",
    "bodyPart" : "upper arms",
    "target" : "biceps"
  },
  {
    "name" : "cable cross-over lateral pulldown",
    "id" : "0153",
    "bodyPart" : "back",
    "target" : "lats",
    "equipment" : "cable",
    "instructions" : [
      "Attach a cable handle to each side of a cable machine at shoulder height.",
      "Stand in the middle of the machine with your feet shoulder-width apart.",
      "Grasp the handles with an overhand grip and step back to create tension in the cables.",
      "Lean forward slightly from the hips, keeping your back straight and your chest up.",
      "Pull the handles down and across your body, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wZcuUYxVggchpR"
  },
  {
    "equipment" : "cable",
    "target" : "delts",
    "id" : "0154",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/OPKjdZ1pRNybcU",
    "secondaryMuscles" : [
      "rhomboids",
      "trapezius"
    ],
    "instructions" : [
      "Attach a D-handle to each low pulley cable and stand in the middle of the cable crossover machine.",
      "Grasp the handles with a pronated grip (palms facing down) and take a step forward, positioning your feet shoulder-width apart.",
      "Bend your knees slightly and lean forward at the waist, keeping your back straight and your abs engaged.",
      "With your arms extended out to the sides and slightly bent at the elbows, exhale and squeeze your shoulder blades together as you pull the cables back and upward in a reverse fly motion.",
      "Pause for a moment at the peak contraction, then inhale and slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable cross-over revers fly",
    "bodyPart" : "shoulders"
  },
  {
    "id" : "0868",
    "target" : "biceps",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/qk5iqrzyvJPWcO",
    "equipment" : "cable",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "cable curl",
    "instructions" : [
      "Stand facing the cable machine with your feet shoulder-width apart.",
      "Grasp the cable attachment with an underhand grip, palms facing up.",
      "Keep your elbows close to your sides and your upper arms stationary.",
      "Exhale and curl the cable attachment towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the cable attachment back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "cable decline fly",
    "bodyPart" : "chest",
    "instructions" : [
      "Adjust the cable machine to a decline position.",
      "Stand facing away from the machine with your feet shoulder-width apart.",
      "Hold the handles with your palms facing forward and your arms extended straight out in front of you.",
      "Keeping a slight bend in your elbows, open your arms out to the sides in a controlled motion.",
      "Pause for a moment at the fully extended position, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pbtxK6LjvZKk4f",
    "id" : "0158",
    "equipment" : "cable",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ]
  },
  {
    "bodyPart" : "chest",
    "equipment" : "cable",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/-O0sVVWbgcFj9u",
    "id" : "1261",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "instructions" : [
      "Adjust the cable machine to a decline position.",
      "Sit on the decline bench facing the cable machine.",
      "Grasp the handles with an overhand grip and position them at chest level.",
      "Keep your feet flat on the ground and your back firmly against the bench.",
      "Exhale and push the handles away from your body, extending your arms fully.",
      "Pause for a moment at the end of the movement, squeezing your chest muscles.",
      "Inhale and slowly return the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable decline press",
    "target" : "pectorals"
  },
  {
    "bodyPart" : "shoulders",
    "equipment" : "cable",
    "target" : "delts",
    "id" : "0161",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/eVpkAClFIEypQj",
    "secondaryMuscles" : [
      "triceps",
      "forearms"
    ],
    "name" : "cable forward raise",
    "instructions" : [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold the cable handle with an overhand grip, palms facing down, and your arms fully extended in front of you.",
      "Keeping your arms straight, raise the cable handle up to shoulder level.",
      "Pause for a moment at the top, then slowly lower the cable handle back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and grasp the cable handle with an overhand grip.",
      "Keep your back straight and your core engaged.",
      "Raise the cable handle in front of you, keeping your arms straight and your palms facing down.",
      "Continue lifting until your arms are parallel to the floor.",
      "Pause for a moment at the top, then slowly lower the cable handle back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "cable",
    "bodyPart" : "shoulders",
    "name" : "cable front raise",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/WGqTTUxjUS3g1I",
    "secondaryMuscles" : [
      "triceps",
      "forearms"
    ],
    "target" : "delts",
    "id" : "0162"
  },
  {
    "secondaryMuscles" : [
      "trapezius",
      "biceps"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/C07m-R3FKGgGdT",
    "equipment" : "cable",
    "target" : "delts",
    "instructions" : [
      "Stand with your feet shoulder-width apart and grasp the cable handle with an overhand grip.",
      "Keep your back straight and your core engaged.",
      "Raise the cable handle in front of you, keeping your arms straight and your palms facing down.",
      "Continue lifting until your arms are parallel to the floor.",
      "Pause for a moment at the top, then slowly lower the cable handle back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable front shoulder raise",
    "bodyPart" : "shoulders",
    "id" : "0164"
  },
  {
    "target" : "triceps",
    "name" : "cable kickback",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/0ld8LNYc6ZSN1o",
    "id" : "0860",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Stand facing a cable machine with your feet shoulder-width apart.",
      "Hold the cable handle with your right hand and step back to create tension in the cable.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Keep your upper arm close to your body and your elbow bent at a 90-degree angle.",
      "Extend your forearm backward, straightening your arm fully.",
      "Pause for a moment, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "equipment" : "cable"
  },
  {
    "name" : "cable lateral pulldown with v-bar",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/J-7QuRPI53FIoG",
    "bodyPart" : "back",
    "equipment" : "cable",
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "instructions" : [
      "Sit down on the cable pulldown machine and grab the v-bar attachment with an overhand grip.",
      "Adjust the knee pad so that your thighs are secured under it.",
      "Keep your back straight and lean back slightly.",
      "Pull the v-bar down towards your upper chest while keeping your elbows close to your body.",
      "Squeeze your back muscles at the bottom of the movement.",
      "Slowly return the v-bar to the starting position and repeat for the desired number of repetitions."
    ],
    "id" : "2616"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and grasp the cable handles with an overhand grip.",
      "Keep your arms straight and your core engaged.",
      "Raise your arms out to the sides until they are parallel to the floor.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable lateral raise",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/t3QDBtI5MqklEO",
    "target" : "delts",
    "secondaryMuscles" : [
      "traps",
      "triceps"
    ],
    "id" : "0178",
    "equipment" : "cable",
    "bodyPart" : "shoulders"
  },
  {
    "equipment" : "cable",
    "secondaryMuscles" : [
      "deltoids",
      "triceps"
    ],
    "name" : "cable low fly",
    "target" : "pectorals",
    "instructions" : [
      "Attach the handles to the low pulleys of a cable machine and select an appropriate weight.",
      "Stand in the middle of the machine with your feet shoulder-width apart and a slight bend in your knees.",
      "Grasp the handles with an overhand grip and extend your arms out to the sides, keeping a slight bend in your elbows.",
      "Maintaining control, slowly bring your arms forward in a sweeping motion, crossing them in front of your body.",
      "Pause for a moment at the peak of the movement, feeling the stretch in your chest muscles.",
      "Reverse the motion and slowly return your arms to the starting position, keeping tension on your chest muscles throughout.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "id" : "0179",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/psFXlWSQhf0JEX"
  },
  {
    "name" : "cable low seated row",
    "id" : "0180",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Oehmt6nBtFfSF6",
    "bodyPart" : "back",
    "target" : "upper back",
    "equipment" : "cable",
    "instructions" : [
      "Sit on the machine with your feet flat on the footrests and your knees slightly bent.",
      "Grasp the handles with an overhand grip, palms facing down.",
      "Keep your back straight and lean slightly forward, maintaining a slight bend in your elbows.",
      "Pull the handles towards your body, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ]
  },
  {
    "name" : "cable one arm lateral raise",
    "bodyPart" : "shoulders",
    "target" : "delts",
    "secondaryMuscles" : [
      "traps",
      "triceps"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/lVBs3DGKAeJJF2",
    "instructions" : [
      "Stand with your feet shoulder-width apart, facing the cable machine.",
      "Hold the cable handle with one hand, palm facing down, and stand far enough away from the machine so that there is tension on the cable.",
      "Keep your arm straight and slowly raise it out to the side until it is parallel to the ground.",
      "Pause for a moment at the top, then slowly lower your arm back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "equipment" : "cable",
    "id" : "0192"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "cable one arm pulldown",
    "bodyPart" : "back",
    "equipment" : "cable",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ejZ8FNFY6qUQc2",
    "target" : "lats",
    "instructions" : [
      "Attach a single handle to a high pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Grasp the handle with an overhand grip and extend your arm fully.",
      "Keep your back straight and your core engaged.",
      "Pull the handle down towards your side while keeping your elbow close to your body.",
      "Pause for a moment at the bottom of the movement, squeezing your lat muscle.",
      "Slowly release the handle back to the starting position.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and repeat the exercise with the other arm."
    ],
    "id" : "3563"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/rJJIokajbxBA6p",
    "name" : "cable overhead curl",
    "target" : "biceps",
    "equipment" : "cable",
    "instructions" : [
      "Attach a straight bar to a high pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Grasp the bar with an underhand grip, hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary.",
      "Exhale and curl the bar down towards your forehead, keeping your upper arms stationary.",
      "Pause for a moment at the bottom of the movement, squeezing your biceps.",
      "Inhale and slowly return the bar to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "id" : "1636",
    "secondaryMuscles" : [
      "forearms",
      "shoulders"
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/KHTJ-lawKWVMjY",
    "secondaryMuscles" : [
      "forearms"
    ],
    "id" : "0195",
    "instructions" : [
      "Adjust the cable machine so that the preacher curl pad is at chest height.",
      "Sit on the preacher curl bench and place your upper arms on the pad, gripping the cable attachment with an underhand grip.",
      "Keep your back straight and your elbows tucked in at your sides.",
      "Slowly curl the cable attachment up towards your shoulders, squeezing your biceps at the top of the movement.",
      "Pause for a moment, then slowly lower the cable attachment back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "cable",
    "name" : "cable preacher curl",
    "target" : "biceps",
    "bodyPart" : "upper arms"
  },
  {
    "equipment" : "cable",
    "instructions" : [
      "Adjust the seat height so that your thighs are parallel to the ground and your feet are flat on the floor.",
      "Grasp the lat bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Sit down and lean back slightly, keeping your chest up and your back straight.",
      "Pull the bar down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "id" : "0197",
    "target" : "lats",
    "name" : "cable pulldown (pro lat bar)",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/IhZ3n0-nvGZGYR"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/gDyJokuVnmmSOy",
    "id" : "1638",
    "bodyPart" : "upper arms",
    "equipment" : "cable",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "cable pulldown bicep curl",
    "target" : "biceps",
    "instructions" : [
      "Attach a straight bar to the cable machine at the highest setting.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Grasp the bar with an underhand grip, hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary.",
      "Exhale and slowly curl the bar down towards your thighs, keeping your wrists straight.",
      "Pause for a moment at the bottom of the movement, squeezing your biceps.",
      "Inhale and slowly return the bar to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "instructions" : [
      "Attach a straight bar to a high pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart and a slight bend in your knees.",
      "Grasp the bar with an overhand grip, hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary.",
      "Exhale and push the bar down until your elbows are fully extended.",
      "Pause for a moment, then inhale and slowly return the bar to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable pushdown",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/0TGDBgwHUKYsyf",
    "secondaryMuscles" : [
      "forearms"
    ],
    "id" : "0201",
    "bodyPart" : "upper arms",
    "target" : "triceps",
    "equipment" : "cable"
  },
  {
    "bodyPart" : "back",
    "equipment" : "cable",
    "name" : "cable pushdown (straight arm) v. 2",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/YSHOWTYaIc6wEH",
    "id" : "0199",
    "target" : "lats",
    "instructions" : [
      "Attach a straight bar to a high pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart and a slight bend in your knees.",
      "Grasp the bar with an overhand grip, keeping your arms straight and your palms facing down.",
      "Engage your core and keep your back straight as you exhale and push the bar down towards your thighs.",
      "Pause for a moment at the bottom, then slowly return the bar to the starting position while inhaling.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "equipment" : "cable",
    "instructions" : [
      "Attach a stirrup handle to a low cable pulley and stand facing the machine.",
      "Grasp the handle with your left hand and take a step back with your right foot, positioning your body at a slight angle.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight and your core engaged.",
      "With your left arm extended and your palm facing down, pull the handle towards your chest by retracting your shoulder blade.",
      "Pause for a moment at the top of the movement, squeezing your shoulder blade.",
      "Slowly release the handle back to the starting position and repeat for the desired number of repetitions.",
      "Switch sides and repeat the exercise with your right arm."
    ],
    "name" : "cable rear delt row (stirrups)",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids",
      "biceps"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/U3VAcIUQroeHSn",
    "target" : "delts",
    "id" : "0202"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/tQQH1jvUfHUuLK",
    "id" : "0203",
    "equipment" : "cable",
    "target" : "delts",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids",
      "biceps"
    ],
    "instructions" : [
      "Attach a rope handle to a low pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Grasp the rope handle with an overhand grip, palms facing each other.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Keep your elbows slightly bent and pull the rope towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the tension and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "cable rear delt row (with rope)",
    "bodyPart" : "shoulders"
  },
  {
    "target" : "lats",
    "equipment" : "cable",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/s5xrg8UtpxtC7S",
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ],
    "instructions" : [
      "Adjust the cable machine so that the pulley is at the highest position.",
      "Sit facing the machine with your feet flat on the ground and your knees slightly bent.",
      "Grasp the cable attachment with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Lean back slightly, keeping your back straight and your chest up.",
      "Pull the cable attachment down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the cable back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "id" : "0205",
    "name" : "cable rear pulldown"
  },
  {
    "bodyPart" : "upper arms",
    "target" : "triceps",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Attach a straight bar to the cable machine at the highest setting.",
      "Stand facing the cable machine with your feet shoulder-width apart.",
      "Grasp the bar with an underhand grip, palms facing up, and your hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary throughout the exercise.",
      "Engage your triceps and slowly push the bar down until your arms are fully extended.",
      "Pause for a moment at the bottom, then slowly return the bar to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "2406",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wdTwC1t7lFdGsH",
    "equipment" : "cable",
    "name" : "cable reverse grip triceps pushdown (sz-bar) (with arm blaster)"
  },
  {
    "bodyPart" : "chest",
    "equipment" : "cable",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/K15ptrI8eyRxg7",
    "instructions" : [
      "Attach the handles to the cables at chest height.",
      "Stand with your feet shoulder-width apart, facing away from the cable machine.",
      "Grasp the handles with an overhand grip, palms facing forward.",
      "Step forward slightly to create tension in the cables.",
      "Keep your core engaged and your back straight throughout the exercise.",
      "With a slight bend in your elbows, slowly bring your arms forward and together in front of your chest.",
      "Squeeze your chest muscles at the peak of the movement.",
      "Slowly reverse the movement, returning your arms to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0227",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "deltoids",
      "triceps"
    ],
    "name" : "cable standing fly"
  },
  {
    "bodyPart" : "chest",
    "id" : "0251",
    "target" : "pectorals",
    "instructions" : [
      "Position yourself on parallel bars with your arms fully extended and your body straight.",
      "Lower your body by bending your elbows until your shoulders are below your elbows.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "name" : "chest dip",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/IDYBE7qvJIFp62",
    "equipment" : "body weight"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/HtEnZdpWSqIgBC",
    "equipment" : "body weight",
    "instructions" : [
      "Hang from a pull-up bar with your palms facing towards you and your hands shoulder-width apart.",
      "Engage your core and pull your body up towards the bar, leading with your chest.",
      "Continue pulling until your chin is above the bar.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "chin-up",
    "bodyPart" : "back",
    "id" : "1326",
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ]
  },
  {
    "equipment" : "body weight",
    "id" : "0274",
    "instructions" : [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head with your elbows pointing outwards.",
      "Engage your abs and lift your shoulders off the ground, curling forward towards your knees.",
      "Pause for a moment at the top, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "waist",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/rZ5cIqi0sMYGSi",
    "name" : "crunch floor",
    "target" : "abs",
    "secondaryMuscles" : [
      "hip flexors"
    ]
  },
  {
    "id" : "0277",
    "bodyPart" : "waist",
    "name" : "decline crunch",
    "target" : "abs",
    "equipment" : "body weight",
    "secondaryMuscles" : [
      "hip flexors"
    ],
    "instructions" : [
      "Lie on a decline bench with your feet secured and your knees bent at a 90-degree angle.",
      "Place your hands behind your head or across your chest.",
      "Engage your abs and lift your upper body towards your knees, curling your torso.",
      "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/yWjRPBU3LgK6mg"
  },
  {
    "name" : "deep push up",
    "id" : "1274",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "equipment" : "dumbbell",
    "target" : "pectorals",
    "instructions" : [
      "Start in a high plank position with your hands slightly wider than shoulder-width apart and your body in a straight line.",
      "Lower your chest towards the ground by bending your elbows, keeping them close to your body.",
      "Push through your palms to extend your arms and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pbW85YRkR6odQk"
  },
  {
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "target" : "triceps",
    "equipment" : "body weight",
    "name" : "diamond push-up",
    "instructions" : [
      "Start in a high plank position with your hands close together, forming a diamond shape with your thumbs and index fingers.",
      "Keep your body in a straight line from head to toe, engaging your core and glutes.",
      "Lower your chest towards the diamond shape formed by your hands, keeping your elbows close to your body.",
      "Pause for a moment at the bottom, then push yourself back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/-FNfLVXneMFcSm",
    "id" : "0283"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/-tVboFt-bNFGKI",
    "equipment" : "body weight",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "id" : "1275",
    "instructions" : [
      "Start in a high plank position with your hands slightly wider than shoulder-width apart.",
      "Lower your chest towards the ground, keeping your elbows close to your body.",
      "Once your chest is just above the ground, quickly drop your knees to the ground.",
      "Push yourself back up to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "drop push up",
    "bodyPart" : "chest",
    "target" : "pectorals"
  },
  {
    "bodyPart" : "upper arms",
    "id" : "2403",
    "target" : "biceps",
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold a dumbbell in each hand, palms facing forward.",
      "Place the arm blaster on your upper arms, ensuring a secure fit.",
      "Keeping your upper arms stationary, exhale and curl one dumbbell up towards your shoulder while contracting your biceps.",
      "Continue to raise the dumbbell until your biceps are fully contracted and the dumbbell is at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly lower the dumbbell back to the starting position.",
      "Repeat the movement with the opposite arm.",
      "Continue alternating arms for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/MBLe0L3HmwXVKH",
    "equipment" : "dumbbell",
    "name" : "dumbbell alternate biceps curl (with arm blaster)",
    "secondaryMuscles" : [
      "forearms"
    ]
  },
  {
    "secondaryMuscles" : [
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/EGRwUtSDoIiGVL",
    "name" : "dumbbell alternate hammer preacher curl",
    "id" : "1646",
    "bodyPart" : "upper arms",
    "equipment" : "dumbbell",
    "instructions" : [
      "Sit on a preacher bench with a dumbbell in each hand, palms facing your torso and arms fully extended.",
      "Keep your upper arms stationary and exhale as you curl the weights while contracting your biceps.",
      "Continue to raise the dumbbells until your biceps are fully contracted and the dumbbells are at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "target" : "biceps"
  },
  {
    "bodyPart" : "upper arms",
    "instructions" : [
      "Sit on an exercise ball with your feet flat on the ground and your back straight.",
      "Hold a dumbbell in each hand with your palms facing forward and your arms fully extended.",
      "Keeping your upper arms stationary, exhale and curl one dumbbell while rotating your forearm until your palm is facing your shoulder.",
      "Inhale and slowly lower the dumbbell back to the starting position.",
      "Repeat the curl with the other arm.",
      "Continue alternating curls for the desired number of repetitions."
    ],
    "id" : "1650",
    "target" : "biceps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Apy4IjeXeuenWy",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "dumbbell alternating seated bicep curl on exercise ball",
    "equipment" : "dumbbell"
  },
  {
    "id" : "2137",
    "equipment" : "dumbbell",
    "name" : "dumbbell arnold press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wqaYUzjJSWDx06",
    "target" : "delts",
    "instructions" : [
      "Sit on a bench with back support and hold a dumbbell in each hand at shoulder level, palms facing your body and elbows bent.",
      "Press the dumbbells upward until your arms are fully extended and your palms are facing forward.",
      "Rotate your wrists as you lift, so that your palms are facing forward at the top of the movement.",
      "Pause for a moment at the top, then slowly lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "upper chest"
    ],
    "bodyPart" : "shoulders"
  },
  {
    "id" : "0289",
    "target" : "pectorals",
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Hold a dumbbell in each hand, with your palms facing forward and your arms extended above your chest.",
      "Lower the dumbbells slowly to the sides of your chest, keeping your elbows at a 90-degree angle.",
      "Pause for a moment, then push the dumbbells back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "equipment" : "dumbbell",
    "name" : "dumbbell bench press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/JkAnv0OpRIzm4n",
    "bodyPart" : "chest"
  },
  {
    "target" : "delts",
    "bodyPart" : "shoulders",
    "instructions" : [
      "Sit on a bench with a dumbbell in each hand, resting on your thighs.",
      "Lean back and position the dumbbells to the sides of your chest, palms facing forward.",
      "Press the dumbbells upward until your arms are fully extended.",
      "Pause for a moment at the top, then slowly lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "triceps",
      "chest"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vevf0xzX2pKKg-",
    "id" : "0290",
    "name" : "dumbbell bench seated press"
  },
  {
    "id" : "0293",
    "equipment" : "dumbbell",
    "name" : "dumbbell bent over row",
    "bodyPart" : "back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3GfNKvegb-b9dA",
    "target" : "upper back",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart, knees slightly bent, and hold a dumbbell in each hand with your palms facing your body.",
      "Bend forward at the hips, keeping your back straight and your core engaged.",
      "Let your arms hang straight down towards the floor, with your elbows slightly bent.",
      "Pull the dumbbells up towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the dumbbells back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "equipment" : "dumbbell",
    "instructions" : [
      "Stand up straight with a dumbbell in each hand, palms facing forward and arms fully extended.",
      "Keeping your upper arms stationary, exhale and curl the weights while contracting your biceps.",
      "Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0294",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/alAAlaKibXn0Kz",
    "target" : "biceps",
    "secondaryMuscles" : [
      "forearms"
    ],
    "bodyPart" : "upper arms",
    "name" : "dumbbell biceps curl"
  },
  {
    "secondaryMuscles" : [
      "forearms"
    ],
    "bodyPart" : "upper arms",
    "target" : "biceps",
    "id" : "1654",
    "name" : "dumbbell biceps curl reverse",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ziPlD20OLw2Igi",
    "equipment" : "dumbbell",
    "instructions" : [
      "Stand up straight with a dumbbell in each hand, palms facing down and arms fully extended.",
      "Keeping your upper arms stationary, exhale and curl the weights while contracting your biceps.",
      "Continue to raise the dumbbells until your biceps are fully contracted and the dumbbells are at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "target" : "glutes",
    "name" : "dumbbell clean",
    "id" : "0295",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with an overhand grip.",
      "Bend your knees and lower your hips into a squat position, keeping your back straight and chest up.",
      "Explosively extend your hips and knees, driving through your heels to jump off the ground.",
      "As you jump, shrug your shoulders and pull the dumbbells up towards your shoulders, keeping them close to your body.",
      "Catch the dumbbells at shoulder height, with your elbows pointing forward and your palms facing up.",
      "Lower the dumbbells back down to the starting position by reversing the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3IEK3vNQmhSUJd",
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps",
      "calves"
    ],
    "bodyPart" : "upper legs"
  },
  {
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "instructions" : [
      "Sit on a flat bench with a dumbbell in each hand, resting on your thighs.",
      "Using your thighs to help raise the dumbbells, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width.",
      "Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.",
      "As you breathe in, slowly lower the dumbbells to your side until they are about level with your chest.",
      "As you exhale, use your triceps to lift the dumbbells back to the starting position. Make sure to use only your triceps and do not use your forearms or biceps to help lift the dumbbells.",
      "After a second pause at the contracted position, repeat the movement for the prescribed amount of repetitions."
    ],
    "bodyPart" : "upper arms",
    "name" : "dumbbell close grip press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/QjbAFcWbO9VdF8",
    "id" : "1731",
    "equipment" : "dumbbell",
    "target" : "triceps"
  },
  {
    "name" : "dumbbell concentration curl",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Sit on a bench with your legs spread apart and a dumbbell in one hand, resting your elbow on the inside of your thigh.",
      "Fully extend your arm and hold the dumbbell with an underhand grip.",
      "Keeping your upper arm stationary, exhale and curl the weight up towards your shoulder while contracting your biceps.",
      "Continue to raise the dumbbell until your biceps are fully contracted and the dumbbell is at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly lower the dumbbell back to the starting position.",
      "Repeat for the desired number of repetitions, then switch arms."
    ],
    "equipment" : "dumbbell",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/4mKq4BhL0Qj8RQ",
    "target" : "biceps",
    "id" : "0297"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand.",
      "Take a step forward with your right foot, keeping your back straight and core engaged.",
      "Lower your body by bending both knees until your right thigh is parallel to the ground.",
      "Push through your right heel to return to the starting position.",
      "Repeat with your left leg.",
      "Alternate legs for the desired number of repetitions."
    ],
    "id" : "3635",
    "equipment" : "dumbbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Zq-97ArJ5SSHuV",
    "target" : "glutes",
    "name" : "dumbbell contralateral forward lunge",
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ]
  },
  {
    "instructions" : [
      "Stand up straight with a dumbbell in each hand, palms facing your body.",
      "Keep your elbows close to your torso and your upper arms stationary.",
      "Exhale and curl the weights while contracting your biceps, bringing the dumbbells across your body towards your opposite shoulder.",
      "Continue to raise the dumbbells until your biceps are fully contracted and the dumbbells are at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "dumbbell cross body hammer curl",
    "id" : "0298",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/SiUCz82B5K2lHR",
    "equipment" : "dumbbell",
    "target" : "biceps",
    "bodyPart" : "upper arms"
  },
  {
    "name" : "dumbbell deadlift",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/UWuWmM0iuSicGg",
    "id" : "0300",
    "instructions" : [
      "Stand with your feet shoulder-width apart, toes pointing forward.",
      "Hold a dumbbell in each hand, palms facing your body, arms extended downwards.",
      "Bend at your hips and knees, lowering the dumbbells towards the ground while keeping your back straight.",
      "Push through your heels and extend your hips and knees, lifting the dumbbells back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "target" : "glutes",
    "equipment" : "dumbbell"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Gqjx2y3MFTsADw",
    "id" : "0302",
    "bodyPart" : "chest",
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "name" : "dumbbell decline fly",
    "instructions" : [
      "Lie on a decline bench with your feet secured and your head lower than your hips.",
      "Hold a dumbbell in each hand with your palms facing each other and your arms extended above your chest.",
      "Lower the dumbbells out to the sides in a wide arc until you feel a stretch in your chest.",
      "Pause for a moment, then squeeze your chest muscles to bring the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "pectorals"
  },
  {
    "bodyPart" : "back",
    "instructions" : [
      "Set up a decline bench at a 45-degree angle.",
      "Lie face down on the bench with your chest and stomach resting against it.",
      "Hold a dumbbell in each hand with your arms fully extended towards the floor.",
      "Keeping your arms straight, raise your shoulders towards your ears as high as possible.",
      "Hold the contraction for a moment, then slowly lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "dumbbell",
    "name" : "dumbbell decline shrug",
    "id" : "0305",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/lGyl8ITmVBUVaD",
    "secondaryMuscles" : [
      "shoulders",
      "rhomboids"
    ],
    "target" : "traps"
  },
  {
    "secondaryMuscles" : [
      "shoulders"
    ],
    "name" : "dumbbell decline triceps extension",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/4-gv8PpFXwX53P",
    "equipment" : "dumbbell",
    "target" : "triceps",
    "instructions" : [
      "Lie on a decline bench with your head lower than your feet and hold a dumbbell in each hand, palms facing each other.",
      "Extend your arms fully, keeping your elbows close to your head.",
      "Lower the dumbbells slowly behind your head, bending your elbows.",
      "Pause for a moment, then raise the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0306"
  },
  {
    "name" : "dumbbell finger curls",
    "target" : "forearms",
    "instructions" : [
      "Sit on a bench or chair with your feet flat on the ground and your back straight.",
      "Hold a dumbbell in one hand with an underhand grip, resting your forearm on your thigh, palm facing up.",
      "Allow the dumbbell to roll down to your fingertips, then curl it back up by flexing your fingers.",
      "Repeat for the desired number of repetitions, then switch to the other hand."
    ],
    "bodyPart" : "lower arms",
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "wrist flexors",
      "wrist extensors"
    ],
    "id" : "1437",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ksdJmaiabbHAid"
  },
  {
    "instructions" : [
      "Lie flat on a bench with a dumbbell in each hand, palms facing each other.",
      "Extend your arms straight up over your chest, with a slight bend in your elbows.",
      "Keeping a slight bend in your elbows, lower your arms out to the sides in a wide arc until you feel a stretch in your chest.",
      "Pause for a moment, then reverse the movement and bring the dumbbells back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "pectorals",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "id" : "0308",
    "equipment" : "dumbbell",
    "bodyPart" : "chest",
    "name" : "dumbbell fly",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/QX9jOs-1zY0pSx"
  },
  {
    "id" : "0310",
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "biceps",
      "trapezius"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with your palms facing your thighs.",
      "Keeping your arms straight, exhale and lift the dumbbells in front of you until they are at shoulder level.",
      "Pause for a moment at the top, then inhale and slowly lower the dumbbells back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/OqUeD0nEghFV97",
    "name" : "dumbbell front raise",
    "bodyPart" : "shoulders",
    "target" : "delts"
  },
  {
    "id" : "0313",
    "name" : "dumbbell hammer curl",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/eyywdCBD72McRq",
    "target" : "biceps",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Stand up straight with a dumbbell in each hand, palms facing your torso.",
      "Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward.",
      "This will be your starting position.",
      "Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps.",
      "Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Then, inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "bodyPart" : "upper arms",
    "equipment" : "dumbbell"
  },
  {
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Set an incline bench to a 45-degree angle.",
      "Sit on the bench with a dumbbell in each hand, palms facing each other.",
      "Lie back on the bench and press the dumbbells up to the starting position, directly above your chest.",
      "Lower the dumbbells out to the sides in a wide arc until you feel a stretch in your chest.",
      "Pause for a moment, then squeeze your chest muscles to bring the dumbbells back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/jEUF4zPFpN8nSk",
    "target" : "pectorals",
    "equipment" : "dumbbell",
    "name" : "dumbbell incline fly",
    "id" : "0319",
    "bodyPart" : "chest"
  },
  {
    "target" : "delts",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TqkM1M4hf8-F5h",
    "instructions" : [
      "Sit on an incline bench with a dumbbell in each hand, resting on your thighs.",
      "Lean back on the bench and raise the dumbbells to shoulder height, palms facing forward.",
      "Keeping your back against the bench, exhale and raise the dumbbells above your head, fully extending your arms.",
      "Pause for a moment at the top, then inhale and slowly lower the dumbbells back to shoulder height.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders",
    "name" : "dumbbell incline raise",
    "equipment" : "dumbbell",
    "id" : "0325",
    "secondaryMuscles" : [
      "trapezius",
      "triceps"
    ]
  },
  {
    "id" : "0326",
    "bodyPart" : "shoulders",
    "name" : "dumbbell incline rear lateral raise",
    "equipment" : "dumbbell",
    "target" : "delts",
    "secondaryMuscles" : [
      "traps",
      "rhomboids"
    ],
    "instructions" : [
      "Set up an incline bench at a 45-degree angle.",
      "Sit on the bench with your chest against the backrest and hold a dumbbell in each hand.",
      "Extend your arms straight down with your palms facing each other.",
      "Keeping a slight bend in your elbows, raise your arms out to the sides until they are parallel to the ground.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/j7W0bKlxN5lDrc"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/z-tOCtmYiEHdJR",
    "id" : "0327",
    "name" : "dumbbell incline row",
    "instructions" : [
      "Set up an incline bench at a 45-degree angle.",
      "Grab a dumbbell in each hand and sit on the bench with your chest against the incline.",
      "Extend your arms fully, allowing the dumbbells to hang straight down from your shoulders.",
      "Pull the dumbbells up towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "upper back",
    "secondaryMuscles" : [
      "biceps",
      "shoulders"
    ],
    "equipment" : "dumbbell",
    "bodyPart" : "back"
  },
  {
    "equipment" : "dumbbell",
    "name" : "dumbbell incline shrug",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Set an incline bench to a 45-degree angle and sit on it with a dumbbell in each hand.",
      "Place your feet flat on the ground and let your arms hang straight down with your palms facing your body.",
      "Keeping your arms straight, shrug your shoulders up towards your ears as high as possible.",
      "Hold the contraction for a moment, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "traps",
    "id" : "0329",
    "bodyPart" : "back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ZRHjt5xZtpEbVj"
  },
  {
    "equipment" : "dumbbell",
    "id" : "0333",
    "target" : "triceps",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/tlSiTFIG9UO17E",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "name" : "dumbbell kickback",
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Bring your upper arms close to your sides, with your elbows bent at a 90-degree angle.",
      "Extend your arms straight back, squeezing your triceps at the top of the movement.",
      "Pause for a moment, then slowly lower the dumbbells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "target" : "delts",
    "id" : "0334",
    "secondaryMuscles" : [
      "traps"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand, palms facing your body.",
      "Keep your back straight and engage your core.",
      "Raise your arms out to the sides until they are parallel to the floor, keeping a slight bend in your elbows.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "dumbbell lateral raise",
    "bodyPart" : "shoulders",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/9jApM45I4XZrss",
    "equipment" : "dumbbell"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with your palms facing your body.",
      "Keep your back straight and engage your core.",
      "Raise your arms out to the sides until they are parallel to the ground, keeping a slight bend in your elbows.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Next, raise your arms in front of you until they are parallel to the ground, again keeping a slight bend in your elbows.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/MUnGhbjujtaFoo",
    "target" : "delts",
    "secondaryMuscles" : [
      "trapezius",
      "biceps"
    ],
    "equipment" : "dumbbell",
    "name" : "dumbbell lateral to front raise",
    "id" : "0335"
  },
  {
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "equipment" : "dumbbell",
    "target" : "glutes",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand.",
      "Take a step forward with your right foot, lowering your body into a lunge position.",
      "Keep your back straight and your chest up as you lower your body.",
      "Push through your right heel to return to the starting position.",
      "Repeat with your left leg.",
      "Alternate legs for the desired number of repetitions."
    ],
    "name" : "dumbbell lunge",
    "id" : "0336",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/KAqJipOhAQv-1q"
  },
  {
    "bodyPart" : "back",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in one hand with your palm facing your body.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight and your core engaged.",
      "Let the dumbbell hang straight down towards the floor, with your arm fully extended.",
      "Pull the dumbbell up towards your chest, keeping your elbow close to your body and squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the dumbbell back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "target" : "upper back",
    "equipment" : "dumbbell",
    "id" : "0292",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7hVmwJ18uRNj26",
    "name" : "dumbbell one arm bent-over row"
  },
  {
    "name" : "dumbbell one arm reverse wrist curl",
    "instructions" : [
      "Sit on a bench or chair with your feet flat on the ground.",
      "Hold a dumbbell in one hand with an overhand grip, palm facing down.",
      "Rest your forearm on your thigh, with your wrist hanging off the edge.",
      "Slowly lower the dumbbell towards the ground by flexing your wrist.",
      "Pause for a moment at the bottom, then slowly curl your wrist back up towards your body.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ],
    "bodyPart" : "lower arms",
    "equipment" : "dumbbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/LE0CNk3Ixf0fvT",
    "id" : "0358",
    "target" : "forearms",
    "secondaryMuscles" : [
      "wrist extensors"
    ]
  },
  {
    "name" : "dumbbell one arm reverse fly (with support)",
    "id" : "0359",
    "target" : "delts",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/0nY4U7aSfJsRfP",
    "equipment" : "dumbbell",
    "instructions" : [
      "Sit on a bench with your feet flat on the ground and your back straight.",
      "Hold a dumbbell in one hand with your palm facing inwards.",
      "Lean forward and place your free hand on the bench for support.",
      "Keep your arm slightly bent and raise it out to the side until it is parallel to the ground.",
      "Pause for a moment at the top, then slowly lower your arm back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch arms."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Qf87tjtQIsz0fK",
    "equipment" : "dumbbell",
    "name" : "dumbbell reverse fly",
    "target" : "delts",
    "bodyPart" : "shoulders",
    "id" : "0383",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Extend your arms straight down in front of you, palms facing each other.",
      "Keeping a slight bend in your elbows, raise your arms out to the sides until they are parallel to the ground.",
      "Pause for a moment at the top, then slowly lower your arms back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with an overhand grip.",
      "Keeping your back straight and your core engaged, hinge at the hips and lower the dumbbells towards the ground, allowing your knees to bend slightly.",
      "Lower the dumbbells until you feel a stretch in your hamstrings, then push through your heels and engage your glutes to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/N-oljGa9SacC4n",
    "equipment" : "dumbbell",
    "name" : "dumbbell romanian deadlift",
    "target" : "glutes",
    "id" : "1459"
  },
  {
    "equipment" : "dumbbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/He8C7XThPFSPd9",
    "instructions" : [
      "Sit on a bench with a dumbbell in each hand, resting on your thighs.",
      "Raise the dumbbells to shoulder height, palms facing forward.",
      "Press the dumbbells upward until your arms are fully extended overhead.",
      "Pause for a moment at the top, then slowly lower the dumbbells back to shoulder height.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "delts",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "id" : "0405",
    "name" : "dumbbell seated shoulder press"
  },
  {
    "equipment" : "dumbbell",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "bodyPart" : "back",
    "id" : "0406",
    "name" : "dumbbell shrug",
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing your body.",
      "Keep your arms straight and let the dumbbells hang by your sides.",
      "Raise your shoulders as high as possible, as if you are trying to touch your ears with your shoulders.",
      "Hold the contraction for a second, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "traps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/SuhDFQVu59XEGQ"
  },
  {
    "id" : "1680",
    "name" : "dumbbell standing one arm curl over incline bench",
    "secondaryMuscles" : [
      "forearms"
    ],
    "equipment" : "dumbbell",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in one hand.",
      "Place your other hand on an incline bench for support.",
      "Keeping your upper arm stationary, curl the dumbbell towards your shoulder by contracting your biceps.",
      "Pause for a moment at the top, then slowly lower the dumbbell back to the starting position.",
      "Repeat for the desired number of repetitions, then switch arms."
    ],
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/zFcUtF0Z-QNK2H",
    "target" : "biceps"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/a24r1EvADipWB4",
    "bodyPart" : "waist",
    "secondaryMuscles" : [
      "obliques"
    ],
    "name" : "elbow-to-knee",
    "instructions" : [
      "Start by lying flat on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head with your elbows pointing outwards.",
      "Engage your abs and lift your upper body off the ground, bringing your right elbow towards your left knee.",
      "At the same time, bring your left knee towards your right elbow, creating a twisting motion.",
      "Pause for a moment at the top, then slowly lower your upper body and extend your legs back to the starting position.",
      "Repeat the movement, this time bringing your left elbow towards your right knee and your right knee towards your left elbow.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "equipment" : "body weight",
    "target" : "abs",
    "id" : "0443"
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "chest"
    ],
    "name" : "ez bar lying bent arms pullover",
    "bodyPart" : "back",
    "instructions" : [
      "Lie flat on a bench with your head at one end and your feet on the floor.",
      "Hold the EZ barbell with a pronated grip (palms facing away from you) and your hands shoulder-width apart.",
      "Extend your arms straight above your chest, keeping a slight bend in your elbows.",
      "Lower the barbell in an arc motion behind your head, maintaining the slight bend in your elbows.",
      "Pause for a moment, then return the barbell to the starting position by reversing the arc motion.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "3010",
    "equipment" : "ez barbell",
    "target" : "lats",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TRQdvs3ZDUebiM"
  },
  {
    "equipment" : "ez barbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/670sw2L06q301L",
    "target" : "triceps",
    "bodyPart" : "upper arms",
    "name" : "ez bar lying close grip triceps extension behind head",
    "id" : "1748",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Lie flat on a bench with your feet flat on the ground and your head at the end of the bench.",
      "Hold the ez barbell with a close grip, palms facing up, and extend your arms straight up over your chest.",
      "Keeping your upper arms stationary, slowly lower the barbell behind your head by bending your elbows.",
      "Pause for a moment, then extend your arms back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Hold the ez barbell with an underhand grip, palms facing up, and hands shoulder-width apart.",
      "Bend forward at the hips, keeping your back straight and chest up, until your torso is almost parallel to the floor.",
      "Pull the ez barbell towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the ez barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/j0PGKJGo5YNG8Z",
    "id" : "1344",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "ez bar reverse grip bent over row",
    "target" : "upper back",
    "bodyPart" : "back",
    "equipment" : "ez barbell"
  },
  {
    "equipment" : "ez barbell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/sOfTitf3kXBvcd",
    "target" : "triceps",
    "name" : "ez bar standing french press",
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold the ez barbell with an overhand grip.",
      "Raise the barbell above your head, fully extending your arms.",
      "Keeping your upper arms close to your head, slowly lower the barbell behind your head by bending your elbows.",
      "Pause for a moment, then extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "id" : "1749",
    "secondaryMuscles" : [
      "shoulders"
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/R0jZq7LY3Vmm12",
    "equipment" : "ez barbell",
    "name" : "ez barbell close grip preacher curl",
    "id" : "1627",
    "bodyPart" : "upper arms",
    "target" : "biceps",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Sit on a preacher curl bench and place your upper arms on the pad, gripping the ez barbell with an underhand grip.",
      "Rest your triceps on the pad and fully extend your arms, keeping your back straight.",
      "Slowly curl the barbell towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top, squeezing your biceps.",
      "Lower the barbell back to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/NeVgGY6UNIefgf",
    "target" : "biceps",
    "name" : "ez barbell curl",
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold the ez barbell with an underhand grip, palms facing up.",
      "Keep your elbows close to your torso and your upper arms stationary throughout the movement.",
      "Exhale as you curl the barbell up towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top, then inhale as you slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "equipment" : "ez barbell",
    "secondaryMuscles" : [
      "forearms"
    ],
    "id" : "0447"
  },
  {
    "id" : "0451",
    "equipment" : "ez barbell",
    "target" : "biceps",
    "bodyPart" : "upper arms",
    "instructions" : [
      "Stand up straight with your feet shoulder-width apart and hold the ez barbell with an underhand grip.",
      "Keep your elbows close to your torso and your upper arms stationary throughout the exercise.",
      "Curl the barbell upwards by contracting your biceps, while exhaling.",
      "Continue to raise the barbell until your biceps are fully contracted and the barbell is at shoulder level.",
      "Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Slowly begin to bring the barbell back to the starting position as you inhale.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/x-tqdT6FUUFhr2",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "ez barbell reverse grip curl"
  },
  {
    "name" : "farmers walk",
    "secondaryMuscles" : [
      "calves",
      "forearms",
      "core"
    ],
    "target" : "quads",
    "equipment" : "dumbbell",
    "bodyPart" : "upper legs",
    "id" : "2133",
    "instructions" : [
      "Stand up straight with a dumbbell in each hand, palms facing your sides.",
      "Keep your back straight and your shoulders back.",
      "Take small, controlled steps forward, maintaining an upright posture.",
      "Continue walking for the desired distance or time.",
      "To finish, stop walking and carefully lower the dumbbells to your sides."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/iHxzGOyZIMlVeI"
  },
  {
    "secondaryMuscles" : [
      "obliques",
      "shoulders"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/GhQ5baALU1BzJs",
    "target" : "abs",
    "equipment" : "kettlebell",
    "name" : "kettlebell advanced windmill",
    "bodyPart" : "waist",
    "id" : "0517",
    "instructions" : [
      "Stand with your feet wider than shoulder-width apart, toes pointing slightly outward.",
      "Hold a kettlebell in your right hand, with your arm extended overhead and your palm facing forward.",
      "Rotate your left foot slightly to the right, and shift your weight onto your left leg.",
      "Bend your left knee and hinge at the hip, lowering your torso towards the left side.",
      "Keep your right arm extended overhead and your eyes on the kettlebell.",
      "As you lower your torso, allow your right leg to straighten and your right foot to pivot slightly.",
      "Lower your torso until you feel a stretch in your left hamstring and your right arm is pointing towards the ground.",
      "Pause for a moment, then engage your core and push through your left heel to return to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7nrSozC6wbRmK7",
    "id" : "0518",
    "bodyPart" : "lower arms",
    "secondaryMuscles" : [
      "shoulders",
      "traps",
      "core"
    ],
    "name" : "kettlebell alternating hang clean",
    "target" : "forearms",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in each hand with an overhand grip.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight and chest up.",
      "Allow the kettlebells to hang in front of your body with your arms fully extended.",
      "In one fluid motion, explosively extend your hips, shrug your shoulders, and pull the kettlebells up towards your shoulders.",
      "As the kettlebells reach shoulder height, rotate your wrists and catch the kettlebells in the rack position, with your palms facing inward and the kettlebells resting on the outside of your forearms.",
      "Lower the kettlebells back down to the starting position and repeat the movement with the opposite arm.",
      "Continue alternating arms for the desired number of repetitions."
    ],
    "equipment" : "kettlebell"
  },
  {
    "equipment" : "kettlebell",
    "target" : "delts",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in each hand at shoulder height.",
      "Press one kettlebell overhead, fully extending your arm.",
      "Lower the kettlebell back to shoulder height.",
      "Repeat with the other arm.",
      "Continue alternating arms for the desired number of repetitions."
    ],
    "name" : "kettlebell alternating press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ViVZGrLoDH7DGs",
    "id" : "0520",
    "secondaryMuscles" : [
      "triceps",
      "core"
    ],
    "bodyPart" : "shoulders"
  },
  {
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ],
    "id" : "0519",
    "name" : "kettlebell alternating press on floor",
    "bodyPart" : "chest",
    "target" : "pectorals",
    "instructions" : [
      "Start by lying on your back on the floor with your knees bent and feet flat on the ground.",
      "Hold a kettlebell in each hand, with your palms facing towards your feet and your arms extended straight up towards the ceiling.",
      "Lower one kettlebell down towards your shoulder while keeping the other kettlebell extended straight up.",
      "Press the lowered kettlebell back up to the starting position while simultaneously lowering the other kettlebell down towards your shoulder.",
      "Continue alternating the press motion with each kettlebell for the desired number of repetitions."
    ],
    "equipment" : "kettlebell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/X51-1S1ok2yg4j"
  },
  {
    "id" : "0521",
    "secondaryMuscles" : [
      "core",
      "shoulders"
    ],
    "instructions" : [
      "Start in a high plank position with your hands gripping the kettlebells and your feet hip-width apart.",
      "Engage your core and keep your body in a straight line from head to heels.",
      "Pull one kettlebell up towards your chest, keeping your elbow close to your body.",
      "Lower the kettlebell back down to the starting position and repeat with the other arm.",
      "Continue alternating arms for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "target" : "upper back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/tcQk1AfPFo0mXS",
    "name" : "kettlebell alternating renegade row",
    "equipment" : "kettlebell"
  },
  {
    "bodyPart" : "back",
    "instructions" : [
      "Stand with your feet shoulder-width apart, knees slightly bent, and hold a kettlebell in each hand with your palms facing your body.",
      "Bend forward at the hips, keeping your back straight and your core engaged.",
      "Pull one kettlebell up towards your chest, keeping your elbow close to your body and squeezing your shoulder blades together.",
      "Lower the kettlebell back down to the starting position and repeat with the other arm.",
      "Continue alternating arms for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/rpOlcyWmKjeIU4",
    "equipment" : "kettlebell",
    "name" : "kettlebell alternating row",
    "id" : "0522",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "target" : "upper back"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/KaPY5JaSDeGPLE",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in each hand at shoulder height with your palms facing towards you.",
      "Engage your core and press the kettlebells overhead, rotating your palms to face forward as you extend your arms.",
      "Pause at the top of the movement, then slowly lower the kettlebells back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "kettlebell",
    "target" : "delts",
    "name" : "kettlebell arnold press",
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "bodyPart" : "shoulders",
    "id" : "0523"
  },
  {
    "equipment" : "kettlebell",
    "name" : "kettlebell front squat",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/nJMnj2qQ20vTf4",
    "target" : "glutes",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the kettlebell with both hands in front of your chest, close to your body.",
      "Engage your core and keep your chest up as you lower your hips down and back, as if sitting into a chair.",
      "Lower until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Drive through your heels to stand back up, squeezing your glutes at the top.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0533",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ]
  },
  {
    "id" : "0534",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/4cOAhQg4DohApw",
    "target" : "glutes",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell close to your chest with both hands.",
      "Keeping your chest up and core engaged, lower your body down into a squat position by bending at the knees and hips.",
      "Continue lowering until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "kettlebell goblet squat",
    "equipment" : "kettlebell",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ]
  },
  {
    "secondaryMuscles" : [
      "glutes",
      "quadriceps",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "equipment" : "kettlebell",
    "name" : "kettlebell hang clean",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in front of your thighs.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Lower the kettlebell towards the ground, allowing it to swing between your legs.",
      "Quickly extend your hips and knees, using the momentum to swing the kettlebell up to shoulder height.",
      "As the kettlebell reaches shoulder height, rotate your wrists and catch the kettlebell in the rack position, with your elbow tucked in and the kettlebell resting on your forearm.",
      "Lower the kettlebell back down to the starting position between your legs, and repeat for the desired number of repetitions."
    ],
    "id" : "0535",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/a-622RLmajFLoq",
    "target" : "hamstrings"
  },
  {
    "equipment" : "kettlebell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/L7WLUcCMknkcdB",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in one hand with an overhand grip.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight and your core engaged.",
      "Pull the kettlebell up towards your chest, keeping your elbow close to your body and squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the kettlebell back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides and repeat with the other arm."
    ],
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "bodyPart" : "back",
    "target" : "upper back",
    "id" : "0541",
    "name" : "kettlebell one arm row"
  },
  {
    "secondaryMuscles" : [
      "trapezius",
      "forearms",
      "core"
    ],
    "name" : "kettlebell one arm snatch",
    "target" : "delts",
    "equipment" : "kettlebell",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in one hand between your legs.",
      "Bend your knees slightly and hinge at the hips, lowering the kettlebell towards the ground.",
      "Explosively extend your hips and knees, using the momentum to swing the kettlebell up towards your shoulder.",
      "As the kettlebell reaches shoulder height, rotate your hand and punch it straight up overhead, fully extending your arm.",
      "Lower the kettlebell back down between your legs and repeat for the desired number of repetitions."
    ],
    "id" : "0542",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/FfbFpjpSW1P2sf",
    "bodyPart" : "shoulders"
  },
  {
    "name" : "kettlebell pistol squat",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a kettlebell in front of your chest with both hands.",
      "Lift your left foot off the ground and extend it forward, keeping it parallel to the ground.",
      "Slowly lower your body down into a squat position, keeping your right foot flat on the ground and your left leg extended.",
      "Pause for a moment at the bottom of the squat, then push through your right heel to return to the starting position.",
      "Repeat for the desired number of repetitions, then switch legs."
    ],
    "target" : "glutes",
    "id" : "0544",
    "equipment" : "kettlebell",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Pto7P6sM4OVmhr"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and hold the barbell with both hands in front of your chest.",
      "Bend your knees slightly and rotate your torso to the right, swinging the barbell down towards your right hip.",
      "As you reach the bottom of the movement, quickly reverse the motion and rotate your torso to the left, swinging the barbell up and across your body towards your left shoulder.",
      "Continue this twisting motion, alternating sides, for the desired number of repetitions."
    ],
    "name" : "landmine 180",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ogEQdSR-UzzVbk",
    "equipment" : "barbell",
    "secondaryMuscles" : [
      "obliques",
      "quadriceps"
    ],
    "id" : "0562",
    "target" : "abs",
    "bodyPart" : "waist"
  },
  {
    "instructions" : [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Hold the barbell with an overhand grip, resting it on the front of your shoulders.",
      "Keeping your core engaged and back straight, lift the barbell up and away from your body, raising it to shoulder height.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "traps",
      "upper back"
    ],
    "id" : "3237",
    "name" : "landmine lateral raise",
    "equipment" : "barbell",
    "target" : "delts",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/je0XFMG5kvU7mp"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/BxsgH3SnE4pt3u",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "target" : "lats",
    "instructions" : [
      "Adjust the leverage machine to your desired resistance level.",
      "Stand on the foot platform and grip the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Hang with your arms fully extended, keeping your body straight.",
      "Engage your back muscles and pull your body up towards the handles, leading with your chest.",
      "Continue pulling until your chin is above the handles.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "name" : "lever assisted chin-up",
    "id" : "0572",
    "equipment" : "leverage machine"
  },
  {
    "id" : "0573",
    "equipment" : "leverage machine",
    "bodyPart" : "back",
    "target" : "spine",
    "name" : "lever back extension",
    "instructions" : [
      "Adjust the machine to fit your body size and range of motion.",
      "Sit on the machine with your back against the pad and your feet secured.",
      "Place your hands on the handles or grip bars.",
      "Engage your core and slowly lean forward, allowing your back to round slightly.",
      "Pause for a moment at the bottom position, feeling a stretch in your lower back.",
      "Using your back muscles, slowly raise your torso back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "glutes",
      "hamstrings"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/cWl0vJSMU5WS6V"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/V0KWsU1NP-MVE3",
    "name" : "lever bent over row",
    "equipment" : "barbell",
    "instructions" : [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Hold the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Bend forward at the hips, keeping your back straight and chest up.",
      "Pull the barbell towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "target" : "upper back",
    "id" : "0574"
  },
  {
    "instructions" : [
      "Adjust the seat height and position yourself facing the machine.",
      "Grasp the v-bar with an overhand grip, keeping your back straight and your knees slightly bent.",
      "Pull the v-bar towards your abdomen, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the weight back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "3200",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "equipment" : "leverage machine",
    "bodyPart" : "back",
    "name" : "lever bent-over row with v-bar",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/kbGaihTV6swjN-",
    "target" : "upper back"
  },
  {
    "target" : "biceps",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "forearms"
    ],
    "name" : "lever bicep curl",
    "id" : "0575",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/BY8iBvWOdvt475",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the handles with an underhand grip, palms facing up, and keep your elbows close to your sides.",
      "Exhale and curl the handles upward, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the handles back to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms"
  },
  {
    "target" : "calves",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ve-y4HM2nG3RQP",
    "bodyPart" : "lower legs",
    "equipment" : "leverage machine",
    "id" : "2289",
    "instructions" : [
      "Adjust the seat of the leverage machine so that your shoulders are aligned with the lever pad.",
      "Place your toes on the lever pad, with your heels hanging off the edge.",
      "Grasp the handles or side supports for stability.",
      "Push the lever pad down by extending your ankles, contracting your calf muscles.",
      "Pause for a moment at the bottom of the movement.",
      "Slowly return to the starting position by allowing your heels to rise back up.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever calf press",
    "secondaryMuscles" : [
      "hamstrings"
    ]
  },
  {
    "target" : "pectorals",
    "name" : "lever chest press",
    "bodyPart" : "chest",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
      "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
      "Push the handles forward until your arms are fully extended, exhaling during the movement.",
      "Pause briefly at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0577",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/cDNawedmUsKweW"
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
      "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
      "Push the handles forward until your arms are fully extended, exhaling during the movement.",
      "Pause briefly at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "id" : "0576",
    "name" : "lever chest press",
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/yj1gMrT9EaTcrE",
    "target" : "pectorals"
  },
  {
    "target" : "glutes",
    "equipment" : "leverage machine",
    "bodyPart" : "upper legs",
    "id" : "0578",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ulb17QVIjH9B-s",
    "name" : "lever deadlift",
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps"
    ],
    "instructions" : [
      "Adjust the seat height and foot platform to your desired position.",
      "Sit on the machine with your back against the pad and your feet flat on the foot platform.",
      "Grasp the handles or the sides of the seat for stability.",
      "Engage your glutes and hamstrings, and push through your heels to lift the weight up.",
      "Keep your back straight and avoid rounding your shoulders.",
      "Extend your hips fully at the top of the movement, squeezing your glutes.",
      "Lower the weight back down in a controlled manner, keeping tension on your glutes and hamstrings.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "lever decline chest press",
    "bodyPart" : "chest",
    "target" : "pectorals",
    "id" : "1300",
    "instructions" : [
      "Adjust the seat height and backrest of the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
      "Push the handles forward and away from your body until your arms are fully extended.",
      "Slowly lower the handles back towards your chest, keeping your elbows slightly bent.",
      "Pause for a moment at the bottom, then push the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/a1N5gp303fxgjx",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ]
  },
  {
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TYS4X9MSW7PJxB",
    "equipment" : "leverage machine",
    "bodyPart" : "lower legs",
    "id" : "1253",
    "target" : "calves",
    "name" : "lever donkey calf raise",
    "instructions" : [
      "Adjust the leverage machine to the appropriate height for your body.",
      "Position yourself facing the machine, with your toes on the foot platform and your heels hanging off the edge.",
      "Place your hands on the handles or the support bars for stability.",
      "Engage your calves and lift your heels as high as possible, using the balls of your feet.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "target" : "lats",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/R1WwFDhl1QdwVD",
    "name" : "lever front pulldown",
    "bodyPart" : "back",
    "equipment" : "leverage machine",
    "id" : "0579",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your knees under the pads and your feet flat on the ground.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Sit upright with your chest lifted and your shoulders back, maintaining a slight arch in your lower back.",
      "Engage your lats and pull the handles down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ]
  },
  {
    "id" : "0580",
    "target" : "traps",
    "name" : "lever gripless shrug",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/FYy5DuSzwcm4g8",
    "secondaryMuscles" : [
      "shoulders",
      "forearms"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the leverage machine.",
      "Grasp the handles with your palms facing inwards and your arms fully extended.",
      "Keeping your back straight, exhale and elevate your shoulders as high as possible.",
      "Hold the contraction for a brief moment, then inhale and slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "bodyPart" : "back"
  },
  {
    "name" : "lever gripless shrug v. 2",
    "bodyPart" : "back",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the handles or bars with an overhand grip, keeping your arms straight.",
      "Keeping your back straight, lift your shoulders up towards your ears as high as possible.",
      "Hold the contraction for a moment, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "traps",
    "secondaryMuscles" : [
      "shoulders",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/w0h-7RpRCCEx7x",
    "id" : "1439"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "triceps"
    ],
    "id" : "2288",
    "bodyPart" : "lower arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/aOtohvM5t-gYMs",
    "instructions" : [
      "Adjust the seat height and grip the handles of the leverage machine.",
      "Keep your back straight and your feet flat on the ground.",
      "Exhale and squeeze the handles, contracting your forearms.",
      "Hold the contraction for a second, then slowly release and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "name" : "lever gripper hands",
    "target" : "forearms"
  },
  {
    "bodyPart" : "upper arms",
    "name" : "lever hammer grip preacher curl",
    "id" : "1615",
    "secondaryMuscles" : [
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vAf42LewSrYV-B",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the leverage machine.",
      "Place your upper arms on the preacher pad, ensuring your chest is pressed against it.",
      "Grasp the handles with a hammer grip (palms facing each other).",
      "Keeping your upper arms stationary, exhale and curl the handles towards your shoulders.",
      "Pause for a moment at the top, squeezing your biceps.",
      "Inhale and slowly lower the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "biceps"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "rear deltoids"
    ],
    "name" : "lever high row",
    "equipment" : "leverage machine",
    "bodyPart" : "back",
    "instructions" : [
      "Adjust the seat height and foot platform to a comfortable position.",
      "Sit on the machine with your chest against the pad and your feet flat on the foot platform.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and engage your core.",
      "Pull the handles towards your body, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "upper back",
    "id" : "0581",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TwyrV8hscgPRfV"
  },
  {
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "instructions" : [
      "Adjust the seat of the machine so that your knees are at a 90-degree angle when your feet are on the footplate.",
      "Sit on the machine with your back against the backrest and your feet shoulder-width apart on the footplate.",
      "Place your hands on the handles or sides of the machine for stability.",
      "Push the footplate away from your body by extending your leg, keeping your back against the backrest.",
      "Pause for a moment at the fully extended position, then slowly bend your leg to return to the starting position.",
      "Repeat for the desired number of repetitions, then switch legs."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7aZFB4rU648oNu",
    "target" : "glutes",
    "name" : "lever horizontal one leg press",
    "equipment" : "leverage machine",
    "id" : "2611"
  },
  {
    "target" : "pectorals",
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ],
    "instructions" : [
      "Adjust the seat and backrest of the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
      "Push the handles forward and away from your body until your arms are fully extended.",
      "Pause for a moment, then slowly bend your elbows and lower the handles back towards your chest.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "id" : "1299",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/2fV5dBzmKYQE-6",
    "equipment" : "leverage machine",
    "name" : "lever incline chest press"
  },
  {
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and backrest angle on the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
      "Push the handles forward and away from your body until your arms are fully extended, but without locking your elbows.",
      "Pause for a moment at the fully extended position, then slowly bend your elbows and lower the handles back towards your chest.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "id" : "1479",
    "name" : "lever incline chest press v. 2",
    "target" : "pectorals",
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/e19AkdTPeWT9p2"
  },
  {
    "name" : "lever kneeling leg curl",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the machine to fit your body and select the desired weight.",
      "Kneel on the machine facing downwards, with your knees resting on the pad and your feet secured under the footpads.",
      "Grasp the handles or the sides of the machine for stability.",
      "Keeping your upper body stationary, exhale and curl your legs up towards your glutes by flexing your knees.",
      "Pause for a moment at the top of the movement, squeezing your hamstrings.",
      "Inhale and slowly lower your legs back to the starting position, fully extending your knees.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/LN4O1TKERMfJbW",
    "id" : "0582",
    "secondaryMuscles" : [
      "glutes"
    ],
    "bodyPart" : "upper legs",
    "target" : "hamstrings"
  },
  {
    "bodyPart" : "waist",
    "name" : "lever kneeling twist",
    "id" : "0583",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/rn9IIDftQmsBKN",
    "target" : "abs",
    "secondaryMuscles" : [
      "obliques",
      "lower back"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your knees resting on the pads and your upper body facing forward.",
      "Grasp the handles or the sides of the machine for stability.",
      "Keeping your core engaged, twist your torso to one side as far as comfortably possible.",
      "Pause for a moment, then slowly return to the starting position.",
      "Repeat the twist to the opposite side.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "equipment" : "leverage machine"
  },
  {
    "name" : "lever lateral raise",
    "target" : "delts",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/OQCFFBMGvzknMt",
    "secondaryMuscles" : [
      "traps",
      "upper back"
    ],
    "id" : "0584",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the handles with an overhand grip and keep your arms straight.",
      "Exhale and raise your arms out to the sides until they are parallel to the floor.",
      "Pause for a moment at the top, then inhale and slowly lower your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "shoulders"
  },
  {
    "id" : "0585",
    "equipment" : "leverage machine",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/dW0FI4TMbH4R9Q",
    "target" : "quads",
    "secondaryMuscles" : [
      "hamstrings"
    ],
    "name" : "lever leg extension",
    "instructions" : [
      "Adjust the seat height and backrest of the machine to fit your body.",
      "Sit on the machine with your back against the backrest and your feet on the footpad.",
      "Grasp the handles or sidebars for stability.",
      "Extend your legs forward by straightening your knees, lifting the weight.",
      "Pause for a moment at the top, then slowly lower the weight back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "target" : "hamstrings",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/FtJ5DqPmNQ8UP3",
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "calves"
    ],
    "instructions" : [
      "Adjust the machine to fit your body and select the desired weight.",
      "Lie face down on the machine with your legs straight and your heels against the padded lever.",
      "Grasp the handles or the sides of the machine for stability.",
      "Keeping your upper body stationary, exhale and curl your legs up as far as possible without lifting your hips off the pad.",
      "Hold the contracted position for a brief pause as you squeeze your hamstrings.",
      "Inhale and slowly lower the lever back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "id" : "0586",
    "name" : "lever lying leg curl"
  },
  {
    "name" : "lever lying two-one leg curl",
    "id" : "3195",
    "equipment" : "leverage machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/t9DextLh-l21EC",
    "secondaryMuscles" : [
      "glutes"
    ],
    "instructions" : [
      "Adjust the machine to fit your body and sit on it with your back against the backrest.",
      "Place your legs on the lever pad, just above your ankles.",
      "Grasp the handles on the sides of the machine for support.",
      "Keeping your upper body still, exhale and curl your legs up towards your glutes.",
      "Pause for a moment at the top, then inhale and slowly lower your legs back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper legs",
    "target" : "hamstrings"
  },
  {
    "id" : "0587",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/uPmtsyWYPJt4iZ",
    "equipment" : "leverage machine",
    "target" : "delts",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the backrest.",
      "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
      "Push the handles upward until your arms are fully extended, but do not lock your elbows.",
      "Pause for a moment at the top, then slowly lower the handles back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "upper chest"
    ],
    "name" : "lever military press",
    "bodyPart" : "shoulders"
  },
  {
    "name" : "lever narrow grip seated row",
    "id" : "0588",
    "equipment" : "leverage machine",
    "bodyPart" : "back",
    "target" : "upper back",
    "instructions" : [
      "Adjust the seat height and footrests to ensure proper form.",
      "Sit on the machine with your feet flat on the footrests and your knees slightly bent.",
      "Grasp the handles with a narrow grip, palms facing each other.",
      "Keep your back straight and lean slightly forward.",
      "Pull the handles towards your torso, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement.",
      "Slowly release the handles and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/I0e2tIdKD0sr1c",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ]
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "shoulders"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself facing the machine.",
      "Grasp the handle with one hand and keep your back straight.",
      "Pull the handle towards your body, keeping your elbow close to your side.",
      "Squeeze your back muscles at the top of the movement.",
      "Slowly release the handle back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "upper back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/NlCUUFykP37DS5",
    "name" : "lever one arm lateral high row",
    "equipment" : "leverage machine",
    "bodyPart" : "back",
    "id" : "1356"
  },
  {
    "name" : "lever one arm lateral wide pulldown",
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your chest against the pad and your feet flat on the floor.",
      "Grasp the handle with an overhand grip and fully extend your arm, keeping a slight bend in your elbow.",
      "Pull the handle down and across your body towards your opposite hip, squeezing your lat muscle at the bottom of the movement.",
      "Slowly return the handle to the starting position, fully extending your arm.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/vbCFBba4dptKNU",
    "bodyPart" : "back",
    "id" : "1347",
    "target" : "lats",
    "equipment" : "leverage machine"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/oijMh2jM9S4bhT",
    "target" : "delts",
    "name" : "lever one arm shoulder press",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "id" : "0590",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the lever handle with one hand and position your elbow at a 90-degree angle.",
      "Press the lever upward until your arm is fully extended overhead.",
      "Pause for a moment at the top, then slowly lower the lever back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ],
    "bodyPart" : "shoulders"
  },
  {
    "equipment" : "leverage machine",
    "target" : "triceps",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "id" : "0591",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/2BfaS4Lfl3pbQS",
    "instructions" : [
      "Adjust the machine to the appropriate height and secure your body in position.",
      "Grasp the handles with an overhand grip and position your body so that your arms are fully extended.",
      "Lower your body by bending your elbows, keeping your upper arms close to your sides.",
      "Continue lowering until your upper arms are parallel to the floor.",
      "Pause for a moment, then push yourself back up to the starting position by extending your elbows.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper arms",
    "name" : "lever overhand triceps dip"
  },
  {
    "id" : "0592",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the leverage machine.",
      "Place your upper arms on the pad and grip the handles with an underhand grip.",
      "Keep your back straight and your elbows positioned on the pad.",
      "Exhale and curl your forearms towards your upper arms, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "forearms"
    ],
    "target" : "biceps",
    "bodyPart" : "upper arms",
    "name" : "lever preacher curl",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/jYejQ2imDcD2tL"
  },
  {
    "equipment" : "leverage machine",
    "name" : "lever preacher curl v. 2",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/kB1ql0vU3kNrwU",
    "target" : "biceps",
    "id" : "1614",
    "bodyPart" : "upper arms",
    "secondaryMuscles" : [
      "forearms"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your upper arms resting on the pad and your chest against the support.",
      "Grasp the handles with an underhand grip, slightly wider than shoulder-width apart.",
      "Keep your upper arms stationary and exhale as you curl the handles towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale as you slowly lower the handles back to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "name" : "lever pullover",
    "equipment" : "leverage machine",
    "target" : "lats",
    "bodyPart" : "back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/XFGwLeMUgcV1OA",
    "instructions" : [
      "Adjust the seat and handles of the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the pad and grasp the handles with an overhand grip.",
      "Keep your arms slightly bent and your core engaged.",
      "Slowly pull the handles towards your chest, squeezing your lats.",
      "Pause for a moment at the peak contraction, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "2285"
  },
  {
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "rhomboids",
      "rear deltoids"
    ],
    "name" : "lever reverse grip lateral pulldown",
    "bodyPart" : "back",
    "id" : "2736",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your knees under the pads and your feet flat on the ground.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Sit upright with your chest out and shoulders back, maintaining a slight arch in your lower back.",
      "Pull the handles down towards your chest, leading with your elbows and squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/XuVyMZxo7t5tU7"
  },
  {
    "bodyPart" : "upper arms",
    "id" : "1616",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/FiKhTU1-wFHrqw",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the leverage machine.",
      "Grasp the handles with an underhand grip, palms facing up.",
      "Rest your upper arms on the preacher pad, ensuring your elbows are fully extended.",
      "Keeping your upper arms stationary, exhale and curl the handles towards your shoulders.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the handles back to the starting position, fully extending your elbows.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "forearms"
    ],
    "target" : "biceps",
    "name" : "lever reverse grip preacher curl"
  },
  {
    "target" : "upper back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/32Hr4s7KjUm797",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and footplate position to ensure proper alignment.",
      "Sit on the machine with your chest against the pad and your feet flat on the footplate.",
      "Grasp the handles with an underhand grip, palms facing up.",
      "Keep your back straight and engage your core.",
      "Pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release and extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "1348",
    "name" : "lever reverse grip vertical row",
    "bodyPart" : "back"
  },
  {
    "equipment" : "leverage machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3WBRWoQEugA6z-",
    "id" : "0593",
    "target" : "glutes",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Adjust the leverage machine to fit your body and secure your feet in the foot pads.",
      "Lie face down on the machine with your upper body hanging off the edge and your hips resting on the pad.",
      "Cross your arms over your chest or place them behind your head.",
      "Engage your glutes and hamstrings to lift your legs upward until they are parallel to the ground.",
      "Pause for a moment at the top, then slowly lower your legs back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever reverse hyperextension",
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ]
  },
  {
    "id" : "1349",
    "name" : "lever reverse t-bar row",
    "equipment" : "leverage machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/GqTem9-0FUP6BN",
    "target" : "upper back",
    "bodyPart" : "back",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "instructions" : [
      "Adjust the seat height and footplate position on the leverage machine.",
      "Sit on the machine with your chest against the pad and your feet flat on the footplate.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and engage your core.",
      "Pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release and extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "equipment" : "leverage machine",
    "bodyPart" : "lower legs",
    "target" : "calves",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/TZkZ5qB6BAsj2P",
    "id" : "2315",
    "name" : "lever rotary calf",
    "secondaryMuscles" : [
      "soleus",
      "ankle stabilizers"
    ],
    "instructions" : [
      "Adjust the seat height so that your knees are slightly bent and your feet are flat on the footplate.",
      "Place your toes on the footplate, with your heels hanging off the edge.",
      "Grasp the handles or the sides of the machine for stability.",
      "Push through the balls of your feet, raising your heels as high as possible.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ElS-BvcEvPKiGZ",
    "secondaryMuscles" : [
      "soleus",
      "hamstrings"
    ],
    "equipment" : "leverage machine",
    "bodyPart" : "lower legs",
    "name" : "lever seated calf press",
    "target" : "calves",
    "id" : "2335",
    "instructions" : [
      "Adjust the seat of the machine so that your shoulders are aligned with the lever pad.",
      "Place your toes on the lower portion of the platform and position your knees under the lever pad.",
      "Grasp the handles on the sides of the seat for stability.",
      "Press the lever pad down by extending your ankles, lifting your heels as high as possible.",
      "Pause for a moment at the top of the movement, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "id" : "0594",
    "instructions" : [
      "Adjust the seat height so that your knees are slightly bent and your feet are flat on the footplate.",
      "Place your toes on the footplate with your heels hanging off the edge.",
      "Grasp the handles or the sides of the seat for stability.",
      "Push through the balls of your feet to raise your heels as high as possible.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever seated calf raise",
    "bodyPart" : "lower legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Q6WpAPkT9lPIFJ",
    "target" : "calves",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "soleus",
      "ankle stabilizers"
    ]
  },
  {
    "bodyPart" : "waist",
    "id" : "1452",
    "equipment" : "leverage machine",
    "target" : "abs",
    "secondaryMuscles" : [
      "obliques"
    ],
    "name" : "lever seated crunch",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/hfKUyEZHb2lqbw",
    "instructions" : [
      "Sit on the leverage machine with your back against the pad and your feet flat on the floor.",
      "Grasp the handles or place your hands on the side pads for support.",
      "Engage your abs and slowly lean back, allowing the pad to move with you.",
      "Once your upper body is at a 45-degree angle, contract your abs and crunch forward, bringing your chest towards your knees.",
      "Pause for a moment at the top, then slowly release and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/q2BCLss8isQZHT",
    "id" : "0595",
    "equipment" : "leverage machine",
    "target" : "abs",
    "secondaryMuscles" : [
      "obliques"
    ],
    "bodyPart" : "waist",
    "instructions" : [
      "Adjust the seat height and chest pad position according to your comfort.",
      "Sit on the machine with your back against the chest pad and your feet flat on the floor.",
      "Grasp the handles or side bars for stability.",
      "Engage your abs and slowly lean back, allowing the chest pad to move with you.",
      "Pause for a moment at the maximum contraction, feeling the tension in your abs.",
      "Slowly return to the starting position by contracting your abs and pulling yourself back up.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever seated crunch (chest pad)"
  },
  {
    "name" : "lever seated crunch v. 2",
    "instructions" : [
      "Sit on the leverage machine with your back against the pad and your feet secured under the footpads.",
      "Place your hands on the handles or the sides of the seat for support.",
      "Engage your abs and slowly crunch forward, bringing your chest towards your knees.",
      "Pause for a moment at the top of the movement, squeezing your abs.",
      "Slowly return to the starting position, allowing your back to round slightly.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "abs",
    "secondaryMuscles" : [
      "obliques",
      "hip flexors"
    ],
    "bodyPart" : "waist",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/7maNChxYOTXKXg",
    "id" : "3760",
    "equipment" : "leverage machine"
  },
  {
    "name" : "lever seated dip",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/qsneEhIRpLC44Z",
    "equipment" : "leverage machine",
    "bodyPart" : "upper arms",
    "id" : "1451",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "target" : "triceps",
    "instructions" : [
      "Adjust the seat height so that your feet are flat on the ground and your knees are at a 90-degree angle.",
      "Grasp the handles of the leverage machine with your palms facing down and your arms fully extended.",
      "Slowly lower your body by bending your elbows until your upper arms are parallel to the ground.",
      "Pause for a moment, then push yourself back up to the starting position by straightening your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "id" : "0596",
    "equipment" : "leverage machine",
    "bodyPart" : "chest",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/8ZxZVi9BNO4DBr",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "deltoids",
      "trapezius"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the handles with a pronated grip and keep your elbows slightly bent.",
      "Exhale and push the handles forward, bringing them together in front of your chest.",
      "Pause for a moment, squeezing your chest muscles.",
      "Inhale and slowly return to the starting position, allowing your chest muscles to stretch.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever seated fly"
  },
  {
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "name" : "lever seated good morning",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/EMOSkaxGkwAwq8",
    "id" : "3759",
    "instructions" : [
      "Adjust the seat height so that your hips are slightly higher than your knees.",
      "Sit on the machine with your back against the pad and your feet flat on the footrests.",
      "Grasp the handles or the sides of the seat for stability.",
      "Keeping your back straight, slowly lean forward from your hips until your upper body is parallel to the ground.",
      "Pause for a moment, then slowly return to the starting position by pushing through your glutes and hamstrings.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "glutes",
    "equipment" : "leverage machine",
    "bodyPart" : "upper legs"
  },
  {
    "secondaryMuscles" : [
      "glutes",
      "hamstrings"
    ],
    "id" : "0597",
    "equipment" : "leverage machine",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/o6PKWIk1YSQLDp",
    "instructions" : [
      "Adjust the seat height so that your knees are at a 90-degree angle.",
      "Sit on the machine with your back against the backrest and your feet on the footrests.",
      "Place your hands on the side handles for stability.",
      "Engage your abductors and slowly push your legs apart, away from the midline of your body.",
      "Pause for a moment at the end of the movement, then slowly bring your legs back together to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "abductors",
    "name" : "lever seated hip abduction"
  },
  {
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/2n9OWXv-puDuZS",
    "name" : "lever seated hip adduction",
    "id" : "0598",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the backrest.",
      "Place your feet on the footrests and grasp the handles for stability.",
      "Engage your adductor muscles and slowly bring your legs together, squeezing your inner thighs.",
      "Pause for a moment at the peak contraction, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "adductors",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ]
  },
  {
    "secondaryMuscles" : [
      "calves"
    ],
    "instructions" : [
      "Adjust the machine to fit your body and sit on it with your back against the backrest.",
      "Place your lower legs under the padded lever, just above your ankles.",
      "Grasp the handles on the sides of the machine for support.",
      "Keeping your upper legs stationary, exhale and curl your legs up as far as possible.",
      "Hold the contracted position for a brief pause as you squeeze your hamstrings.",
      "Inhale and slowly lower the lever back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "hamstrings",
    "name" : "lever seated leg curl",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/jRUJqJZeoklPSf",
    "id" : "0599",
    "equipment" : "leverage machine"
  },
  {
    "id" : "0600",
    "equipment" : "leverage machine",
    "name" : "lever seated leg raise crunch",
    "bodyPart" : "waist",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/LJoer0ypK9ws7O",
    "secondaryMuscles" : [
      "hip flexors"
    ],
    "target" : "abs",
    "instructions" : [
      "Sit on the leverage machine with your back against the backrest and your feet on the footrests.",
      "Grasp the handles or sidebars for stability.",
      "Engage your abs and slowly raise your legs up towards your chest, curling your torso forward at the same time.",
      "Pause for a moment at the top, then slowly lower your legs and torso back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "lever seated reverse fly",
    "bodyPart" : "shoulders",
    "target" : "delts",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your chest against the pad and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and keep your arms slightly bent.",
      "Exhale and squeeze your shoulder blades together as you pull the handles back and outward, away from your body.",
      "Pause for a moment at the peak contraction, then inhale and slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids"
    ],
    "id" : "0602",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/2imf2ouZssOTI5",
    "equipment" : "leverage machine"
  },
  {
    "equipment" : "leverage machine",
    "name" : "lever seated reverse fly (parallel grip)",
    "id" : "0601",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids"
    ],
    "target" : "delts",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ZETLuK46vt3b5f",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your chest against the pad and your feet flat on the floor.",
      "Grasp the handles with a parallel grip, palms facing each other, and keep your arms slightly bent.",
      "Exhale and squeeze your shoulder blades together as you pull the handles back and outward, away from your body.",
      "Pause for a moment at the peak contraction, then inhale and slowly return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "lever seated row",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "target" : "upper back",
    "id" : "1350",
    "instructions" : [
      "Adjust the seat height and footrests to a comfortable position.",
      "Sit on the machine with your chest against the pad and your feet on the footrests.",
      "Grasp the handles with an overhand grip, shoulder-width apart.",
      "Keep your back straight and your core engaged.",
      "Pull the handles towards your body, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement.",
      "Slowly release the handles and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/ih9zVKgLr3dPkj",
    "bodyPart" : "back",
    "equipment" : "leverage machine"
  },
  {
    "equipment" : "leverage machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/kxoEW-rQdv-YTY",
    "bodyPart" : "lower legs",
    "target" : "calves",
    "id" : "1385",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "glutes"
    ],
    "instructions" : [
      "Adjust the seat of the leg press machine so that your knees are slightly bent when your feet are on the footplate.",
      "Sit on the machine with your back against the backrest and your feet flat on the footplate, shoulder-width apart.",
      "Place your toes and the balls of your feet on the footplate, keeping your heels off the edge.",
      "Release the safety handles and push the footplate away from you by extending your knees.",
      "Once your knees are fully extended, slowly lower your heels by flexing your calves.",
      "Pause for a moment at the bottom, then push the footplate back up by extending your calves.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever seated squat calf raise on leg press machine"
  },
  {
    "name" : "lever shoulder press",
    "secondaryMuscles" : [
      "triceps",
      "chest"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the backrest.",
      "Grasp the handles with an overhand grip and position your hands at shoulder level.",
      "Push the handles upward until your arms are fully extended, but do not lock your elbows.",
      "Pause for a moment at the top, then slowly lower the handles back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/bExoAHkSRt2eV7",
    "id" : "0603",
    "bodyPart" : "shoulders",
    "equipment" : "leverage machine",
    "target" : "delts"
  },
  {
    "target" : "delts",
    "name" : "lever shoulder press v. 2",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3FUOiOwhnCpDD-",
    "instructions" : [
      "Adjust the seat height and backrest of the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet flat on the floor.",
      "Grasp the handles of the machine with an overhand grip, slightly wider than shoulder-width apart.",
      "Push the handles upward and forward until your arms are fully extended, but not locked.",
      "Pause for a moment at the top, then slowly lower the handles back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0869",
    "equipment" : "leverage machine",
    "bodyPart" : "shoulders",
    "secondaryMuscles" : [
      "triceps",
      "chest"
    ]
  },
  {
    "name" : "lever shoulder press v. 3",
    "id" : "2318",
    "equipment" : "leverage machine",
    "bodyPart" : "shoulders",
    "target" : "delts",
    "instructions" : [
      "Adjust the seat height and backrest of the leverage machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet flat on the floor.",
      "Grasp the handles of the machine with an overhand grip, slightly wider than shoulder-width apart.",
      "Push the handles upward and forward until your arms are fully extended, but not locked.",
      "Pause for a moment at the top, then slowly lower the handles back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "triceps",
      "chest"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Cy54BGXW1PHhKP"
  },
  {
    "id" : "0604",
    "target" : "traps",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/G0GSIh8n6n8Ifk",
    "equipment" : "leverage machine",
    "instructions" : [
      "Adjust the seat height and position yourself on the leverage machine with your back against the pad.",
      "Grasp the handles with an overhand grip and keep your arms straight.",
      "Keeping your back straight, lift your shoulders up towards your ears as high as possible.",
      "Hold the contraction for a moment, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "lever shrug",
    "bodyPart" : "back"
  },
  {
    "equipment" : "leverage machine",
    "target" : "calves",
    "bodyPart" : "lower legs",
    "instructions" : [
      "Adjust the machine to your height and stand with your feet shoulder-width apart.",
      "Place your shoulders under the pads and hold onto the handles for stability.",
      "Raise your heels as high as possible by extending your ankles.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "soleus",
      "ankle stabilizers"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pNb0I1R4WTu1vT",
    "name" : "lever standing calf raise",
    "id" : "0605"
  },
  {
    "id" : "3758",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/IEsO7l1wPSoajR",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your feet flat on the ground.",
      "Grasp the handles with an overhand grip and position your hands at chest level.",
      "Push the handles forward until your arms are fully extended, keeping your elbows slightly bent.",
      "Pause for a moment, then slowly bring the handles back towards your chest, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "name" : "lever standing chest press",
    "target" : "pectorals",
    "secondaryMuscles" : [
      "shoulders",
      "triceps"
    ],
    "equipment" : "leverage machine"
  },
  {
    "equipment" : "leverage machine",
    "name" : "lever t bar row",
    "bodyPart" : "back",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/dbuH9CEAmjRaN2",
    "id" : "0606",
    "instructions" : [
      "Adjust the seat height and footplate position to ensure proper alignment.",
      "Sit on the machine with your chest against the pad and your feet flat on the footplate.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and engage your core.",
      "Pull the handles towards your torso, squeezing your shoulder blades together.",
      "Pause for a moment at the peak contraction, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "upper back"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/gpJBWKozVBnLYN",
    "target" : "upper back",
    "bodyPart" : "back",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your chest against the pad and your feet flat on the floor.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and engage your core.",
      "Pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release and extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "id" : "1351",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "lever t-bar reverse grip row"
  },
  {
    "name" : "lever triceps extension",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/b1TPpLCfZtaV67",
    "bodyPart" : "upper arms",
    "id" : "0607",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "shoulders"
    ],
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back against the pad.",
      "Grasp the handles with an overhand grip and fully extend your arms in front of you.",
      "Keeping your upper arms stationary, slowly lower the handles towards your forehead by bending your elbows.",
      "Pause for a moment at the bottom, then push the handles back up to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "triceps"
  },
  {
    "bodyPart" : "back",
    "id" : "1313",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/kLHXXwHG6iUGn5",
    "instructions" : [
      "Adjust the seat height and position yourself facing the machine.",
      "Grasp the handles with an overhand grip and keep your back straight.",
      "Pull the handles towards your body, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release and extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "lever unilateral row",
    "target" : "upper back"
  },
  {
    "name" : "low glute bridge on floor",
    "id" : "3013",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/fXuZxUzI3ECOiC",
    "secondaryMuscles" : [
      "hamstrings",
      "core"
    ],
    "equipment" : "body weight",
    "target" : "glutes",
    "instructions" : [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Place your arms by your sides, palms facing down.",
      "Engage your glutes and core, then lift your hips off the ground until your body forms a straight line from your knees to your shoulders.",
      "Pause for a moment at the top, squeezing your glutes.",
      "Slowly lower your hips back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "upper legs"
  },
  {
    "id" : "1301",
    "bodyPart" : "chest",
    "equipment" : "leverage machine",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "name" : "machine inner chest press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/eaZbSVwfd4TRw1",
    "target" : "pectorals",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
      "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
      "Push the handles forward until your arms are fully extended, exhaling during the movement.",
      "Pause for a moment at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "target" : "lats",
    "instructions" : [
      "Start by hanging from a pull-up bar with your palms facing away from you and your arms fully extended.",
      "Engage your core and pull your body up towards the bar, leading with your chest.",
      "As you reach the top of the movement, transition your grip so that your palms are facing towards you.",
      "Continue pulling yourself up until your chest is above the bar and your arms are fully flexed.",
      "Reverse the movement by slowly lowering yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "equipment" : "body weight",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/gLYhD48xKrs9R4",
    "name" : "muscle up",
    "secondaryMuscles" : [
      "biceps",
      "triceps",
      "shoulders",
      "chest"
    ],
    "id" : "0631"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "triceps",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/mm7WbefLMKskPd",
    "equipment" : "body weight",
    "bodyPart" : "back",
    "id" : "1401",
    "instructions" : [
      "Start by hanging from a vertical bar with your palms facing away from you and your arms fully extended.",
      "Engage your core and pull your body up towards the bar, leading with your chest.",
      "As you pull yourself up, lean back slightly and bring your elbows towards your sides.",
      "Continue pulling until your chest reaches the bar and your elbows are fully bent.",
      "Pause for a moment at the top, then slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "lats",
    "name" : "muscle-up (on vertical bar)"
  },
  {
    "instructions" : [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head with your elbows pointing outwards.",
      "Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is at a 45-degree angle.",
      "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/PV27ZodMZDAFuE",
    "target" : "abs",
    "bodyPart" : "waist",
    "id" : "0634",
    "secondaryMuscles" : [
      "hip flexors"
    ],
    "equipment" : "body weight",
    "name" : "negative crunch"
  },
  {
    "secondaryMuscles" : [
      "obliques"
    ],
    "equipment" : "body weight",
    "instructions" : [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Place your hands behind your head or cross them over your chest.",
      "Engage your abs and lift your shoulder blades off the floor, rotating your torso to one side.",
      "Pause for a moment, then lower your shoulder blades back down to the floor.",
      "Repeat on the other side, alternating sides with each repetition."
    ],
    "bodyPart" : "waist",
    "target" : "abs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/BwjRcyf39dsNWQ",
    "id" : "0635",
    "name" : "oblique crunches floor"
  },
  {
    "secondaryMuscles" : [
      "glutes",
      "quadriceps",
      "calves"
    ],
    "equipment" : "barbell",
    "name" : "power clean",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/GEqsoCbksi4oyG",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Start with the barbell on the ground in front of you, with your feet shoulder-width apart.",
      "Bend down and grip the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and chest up as you lift the barbell off the ground, extending your hips and knees.",
      "As the barbell reaches your mid-thigh, explosively pull it upwards, shrugging your shoulders and pulling your elbows high and to the sides.",
      "As the barbell reaches its highest point, quickly drop underneath it, rotating your elbows around and catching the barbell on your shoulders in a front squat position.",
      "Stand up with the barbell, fully extending your hips and knees.",
      "Lower the barbell back down to the starting position, keeping control of the weight throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "hamstrings",
    "id" : "0648"
  },
  {
    "instructions" : [
      "Hang from a pull-up bar with your palms facing away from you and your arms fully extended.",
      "Engage your core and squeeze your shoulder blades together.",
      "Pull your body up towards the bar by bending your elbows and bringing your chest towards the bar.",
      "Pause at the top of the movement, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "name" : "pull-up",
    "equipment" : "body weight",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/iPJYfxHI4UPawl",
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "id" : "0652"
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "deltoids",
      "core"
    ],
    "instructions" : [
      "Start in a high plank position with your hands slightly wider than shoulder-width apart and your feet together.",
      "Engage your core and lower your body towards the ground by bending your elbows, keeping your body in a straight line.",
      "Pause for a moment when your chest is just above the ground, then push yourself back up to the starting position by straightening your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "chest",
    "equipment" : "body weight",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/GS4JXKQHfySLVd",
    "id" : "0662",
    "name" : "push-up",
    "target" : "pectorals"
  },
  {
    "bodyPart" : "chest",
    "name" : "push-up (bosu ball)",
    "id" : "0653",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/fJWkYYCIiV0aVg",
    "secondaryMuscles" : [
      "triceps",
      "shoulders",
      "core"
    ],
    "equipment" : "bosu ball",
    "target" : "pectorals",
    "instructions" : [
      "Place the bosu ball on the ground with the flat side facing up.",
      "Position yourself in a push-up position with your hands on the outer edges of the bosu ball.",
      "Engage your core and lower your body down towards the bosu ball by bending your elbows.",
      "Push yourself back up to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "rear pull-up",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/PoXDPdofkSQwGv",
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "equipment" : "body weight",
    "instructions" : [
      "Grab the pull-up bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Hang from the bar with your arms fully extended and your body straight.",
      "Engage your back muscles and pull your body up towards the bar, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the bar.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "id" : "0670"
  },
  {
    "equipment" : "body weight",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/NLkMmkP71aYSbj",
    "name" : "run",
    "bodyPart" : "cardio",
    "target" : "cardiovascular system",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "instructions" : [
      "Start by standing upright with your feet hip-width apart.",
      "Engage your core and keep your upper body relaxed.",
      "Begin jogging in place, lifting your knees up towards your chest and landing softly on the balls of your feet.",
      "Maintain a steady pace and continue jogging for the desired duration or distance.",
      "Remember to breathe deeply and maintain good posture throughout the exercise."
    ],
    "id" : "0685"
  },
  {
    "target" : "cardiovascular system",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "id" : "0684",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/juCsdsgQcwGaGS",
    "name" : "run (equipment)",
    "equipment" : "body weight",
    "bodyPart" : "cardio",
    "instructions" : [
      "Start by standing upright with your feet hip-width apart.",
      "Engage your core and keep your upper body relaxed.",
      "Begin jogging in place, lifting your knees up towards your chest and landing softly on the balls of your feet.",
      "Maintain a steady pace and continue jogging for the desired duration or distance.",
      "Remember to breathe deeply and maintain good posture throughout the exercise."
    ]
  },
  {
    "bodyPart" : "back",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/LZFGp4mYo1N5o0",
    "equipment" : "body weight",
    "name" : "scapula dips",
    "id" : "3012",
    "target" : "traps",
    "secondaryMuscles" : [
      "rhomboids",
      "deltoids"
    ],
    "instructions" : [
      "Start by standing with your feet shoulder-width apart and your arms extended in front of you.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Lower your body by bending your elbows and retracting your shoulder blades, as if you are trying to squeeze a pencil between them.",
      "Pause for a moment at the bottom, then push through your hands to extend your elbows and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/WbWRCBJgy5hdKz",
    "name" : "sit-up with arms on chest",
    "bodyPart" : "waist",
    "instructions" : [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Cross your arms over your chest.",
      "Engaging your abs, lift your upper body off the ground towards your knees.",
      "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "3679",
    "target" : "abs",
    "secondaryMuscles" : [
      "hip flexors"
    ],
    "equipment" : "body weight"
  },
  {
    "id" : "1425",
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "instructions" : [
      "Adjust the sled machine to a 45-degree angle.",
      "Sit on the sled machine with your back against the pad and your feet on the footplate.",
      "Place one foot on the footplate and extend your leg, pushing the sled away from you.",
      "Slowly bend your knee and lower the sled back to the starting position.",
      "Repeat with the other leg.",
      "Continue alternating legs for the desired number of repetitions."
    ],
    "name" : "sled 45 degrees one leg press",
    "target" : "glutes",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/gOwiSp7qEZXAb-",
    "equipment" : "sled machine"
  },
  {
    "name" : "sled calf press on leg press",
    "target" : "calves",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/KgWiqE1JAY7cht",
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps"
    ],
    "equipment" : "sled machine",
    "instructions" : [
      "Adjust the seat of the leg press machine so that your knees are slightly bent when your feet are on the sled.",
      "Place your feet shoulder-width apart on the sled, with your toes pointing forward.",
      "Release the safety handles and push the sled away from you by extending your knees and ankles.",
      "Pause for a moment at the top of the movement, then slowly lower the sled back down by bending your knees and ankles.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "lower legs",
    "id" : "1391"
  },
  {
    "name" : "sled closer hack squat",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/Dg-LTw9fM-Yksp",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "instructions" : [
      "Adjust the sled machine to a comfortable weight and position yourself with your back against the pad.",
      "Place your feet shoulder-width apart on the platform, toes slightly pointed outwards.",
      "Grip the handles on the sides of the machine for stability.",
      "Engage your core and slowly lower your body by bending your knees and hips, keeping your back straight.",
      "Continue lowering until your thighs are parallel to the ground or slightly below.",
      "Pause for a moment at the bottom, then push through your heels to extend your legs and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "sled machine",
    "target" : "glutes",
    "id" : "0741"
  },
  {
    "id" : "0742",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/szneOnphbmlLzv",
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ],
    "name" : "sled forward angled calf raise",
    "bodyPart" : "lower legs",
    "instructions" : [
      "Adjust the sled machine to a comfortable weight and position yourself on the machine with your toes on the platform and your heels hanging off.",
      "Place your hands on the handles or the sides of the machine for support.",
      "Engage your calves and slowly raise your heels as high as possible, pushing against the resistance of the sled.",
      "Pause for a moment at the top of the movement, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "calves",
    "equipment" : "sled machine"
  },
  {
    "id" : "0743",
    "name" : "sled hack squat",
    "instructions" : [
      "Adjust the sled machine to a comfortable position for your height.",
      "Stand with your feet shoulder-width apart on the platform, toes slightly pointed outwards.",
      "Hold onto the handles or bars for stability.",
      "Lower your body by bending your knees and hips, keeping your back straight and chest up.",
      "Continue lowering until your thighs are parallel to the ground or slightly below.",
      "Pause for a moment, then push through your heels to raise your body back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/N5XuvFGTSwzMRW",
    "target" : "glutes",
    "equipment" : "sled machine",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs"
  },
  {
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ],
    "bodyPart" : "lower legs",
    "target" : "calves",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/lxWgOEqxoNcobX",
    "instructions" : [
      "Adjust the sled machine to a comfortable weight.",
      "Sit on the sled machine with your back against the pad and your feet on the platform.",
      "Place your toes and the balls of your feet on the edge of the platform, with your heels hanging off.",
      "Push the platform away from you by extending your ankles, keeping your knees slightly bent.",
      "Continue pushing until your calves are fully contracted.",
      "Hold the contraction for a moment, then slowly lower the platform back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "sled machine",
    "id" : "2334",
    "name" : "sled lying calf press"
  },
  {
    "id" : "0744",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/g02-W32ysURkMC",
    "target" : "glutes",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "equipment" : "sled machine",
    "name" : "sled lying squat",
    "instructions" : [
      "Adjust the sled machine to a comfortable weight.",
      "Lie on your back on the sled machine with your feet on the footplate.",
      "Position your feet shoulder-width apart and slightly angled outwards.",
      "Grip the handles of the sled machine for stability.",
      "Engage your glutes and core muscles.",
      "Push through your heels and extend your legs to lift the sled.",
      "Lower the sled back down by bending your knees and hips.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "equipment" : "sled machine",
    "bodyPart" : "lower legs",
    "instructions" : [
      "Adjust the seat of the leg press machine so that your knees are slightly bent when your feet are on the sled.",
      "Sit on the machine with your back against the backrest and your feet on the sled, shoulder-width apart.",
      "Place your toes and the balls of your feet on the sled, keeping your heels off.",
      "Push the sled forward by extending your ankles, keeping your knees slightly bent.",
      "Pause for a moment at the top, then slowly lower the sled back down by flexing your ankles.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/NYHZgA30wfsxS6",
    "name" : "sled one leg calf press on leg press",
    "target" : "calves",
    "id" : "1392",
    "secondaryMuscles" : [
      "hamstrings",
      "glutes"
    ]
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "target" : "delts",
    "instructions" : [
      "Adjust the seat height of the smith machine so that the bar is at shoulder level.",
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Lift the bar off the rack and step back, maintaining a stable stance.",
      "Lower the bar down to the back of your neck, keeping your elbows pointing forward.",
      "Press the bar up overhead until your arms are fully extended.",
      "Pause for a moment at the top, then slowly lower the bar back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0747",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/YepLkpUNY6WrRm",
    "equipment" : "smith machine",
    "bodyPart" : "shoulders",
    "name" : "smith behind neck press"
  },
  {
    "target" : "pectorals",
    "bodyPart" : "chest",
    "instructions" : [
      "Adjust the height of the smith machine bar to chest level.",
      "Lie flat on the bench with your feet firmly planted on the ground.",
      "Grip the bar with an overhand grip slightly wider than shoulder-width apart.",
      "Unrack the bar and lower it towards your chest, keeping your elbows tucked in.",
      "Pause for a moment when the bar touches your chest.",
      "Push the bar back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "smith machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/fgWRXlr-a42v-f",
    "id" : "0748",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "name" : "smith bench press"
  },
  {
    "instructions" : [
      "Start by standing with your feet shoulder-width apart, toes pointing forward.",
      "Place the barbell across your upper back, resting it on your traps.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Lower your torso until it is parallel to the ground, feeling a stretch in your hamstrings.",
      "Engage your glutes and hamstrings to raise your torso back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/mIFzqko3bZbBg4",
    "name" : "smith bent knee good morning",
    "bodyPart" : "upper legs",
    "target" : "glutes",
    "secondaryMuscles" : [
      "hamstrings",
      "lower back"
    ],
    "id" : "0749",
    "equipment" : "smith machine"
  },
  {
    "instructions" : [
      "Set up the smith machine with the bar at hip height.",
      "Stand facing the bar with your feet shoulder-width apart.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Grasp the bar with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Pull the bar towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the bar back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/w03H6rwaAQ3cjC",
    "name" : "smith bent over row",
    "id" : "1359",
    "target" : "upper back",
    "equipment" : "smith machine",
    "bodyPart" : "back"
  },
  {
    "target" : "quads",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/pSYw6Ni6MW6WTe",
    "id" : "0750",
    "equipment" : "smith machine",
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "glutes",
      "hamstrings",
      "calves"
    ],
    "name" : "smith chair squat",
    "instructions" : [
      "Adjust the height of the smith machine bar to a comfortable position.",
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Place the barbell across your upper back, resting it on your traps.",
      "Engage your core and keep your chest up as you slowly lower your body by bending your knees and hips.",
      "Continue lowering until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Pause for a moment, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "name" : "smith close-grip bench press",
    "equipment" : "smith machine",
    "bodyPart" : "upper arms",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/M8OIDsKIZRtkMc",
    "target" : "triceps",
    "instructions" : [
      "Adjust the seat height and position yourself on the bench with your feet flat on the ground.",
      "Grasp the barbell with a close grip, slightly narrower than shoulder-width apart.",
      "Lower the barbell towards your chest, keeping your elbows close to your body.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "id" : "0751"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/3kL5p0IqxtQsac",
    "instructions" : [
      "Set up the smith machine with the bar at hip height.",
      "Stand with your feet shoulder-width apart, toes pointing slightly outward.",
      "Bend at the hips and knees, keeping your back straight and chest up, and grip the bar with an overhand grip slightly wider than shoulder-width apart.",
      "Engage your core and lift the bar by extending your hips and knees, keeping the bar close to your body.",
      "Stand up straight, fully extending your hips and knees.",
      "Lower the bar back down by bending at the hips and knees, maintaining control and keeping your back straight.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0752",
    "bodyPart" : "upper legs",
    "equipment" : "smith machine",
    "target" : "glutes",
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps",
      "lower back"
    ],
    "name" : "smith deadlift"
  },
  {
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/X8NKxDr2ysuNd7",
    "equipment" : "smith machine",
    "name" : "smith decline bench press",
    "id" : "0753",
    "secondaryMuscles" : [
      "triceps",
      "shoulders"
    ],
    "instructions" : [
      "Adjust the decline bench to the desired angle.",
      "Lie down on the bench with your feet secured under the foot pads.",
      "Grasp the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows tucked in.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "pectorals",
    "bodyPart" : "chest"
  },
  {
    "id" : "3281",
    "bodyPart" : "upper legs",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/mDN-52wvfGbgzM",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "instructions" : [
      "Set up the smith machine with the barbell at shoulder height.",
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Step under the bar and position it across your upper back, resting on your traps.",
      "Grip the bar with your hands slightly wider than shoulder-width apart.",
      "Unrack the bar and take a step back, maintaining a stable stance.",
      "Keeping your chest up and core engaged, initiate the squat by pushing your hips back and bending your knees.",
      "Lower your body until your thighs are parallel to the ground, or as low as your flexibility allows.",
      "Pause for a moment at the bottom, then drive through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "smith full squat",
    "target" : "glutes",
    "equipment" : "smith machine"
  },
  {
    "instructions" : [
      "Adjust the seat and footplate of the smith machine to a comfortable position.",
      "Sit on the machine with your back against the backrest and your feet shoulder-width apart on the footplate.",
      "Grasp the handles or sides of the machine for stability.",
      "Push the footplate away from you by extending your legs, keeping your back against the backrest.",
      "Pause for a moment at the fully extended position.",
      "Slowly bend your knees and lower the footplate back towards you, returning to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0760",
    "name" : "smith leg press",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/hwkunZ4wUFIsjY",
    "equipment" : "smith machine",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "bodyPart" : "upper legs",
    "target" : "glutes"
  },
  {
    "secondaryMuscles" : [
      "trapezius",
      "rhomboids",
      "biceps"
    ],
    "equipment" : "smith machine",
    "id" : "0762",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/O48h6k3cjXNpGn",
    "name" : "smith rear delt row",
    "bodyPart" : "shoulders",
    "target" : "delts",
    "instructions" : [
      "Adjust the seat height and position yourself on the machine with your chest against the pad and your feet flat on the ground.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and your core engaged as you pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart" : "lower legs",
    "instructions" : [
      "Adjust the smith machine bar to a height just below your shoulders.",
      "Stand facing the bar with your feet hip-width apart and toes pointing forward.",
      "Place the balls of your feet on the edge of a step or platform, with your heels hanging off.",
      "Hold onto the bar for support, keeping your back straight and core engaged.",
      "Raise your heels as high as possible, lifting your body weight onto the balls of your feet.",
      "Pause for a moment at the top, then slowly lower your heels back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "smith machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/16yv95wf6yLXQe",
    "id" : "0763",
    "name" : "smith reverse calf raises",
    "secondaryMuscles" : [
      "hamstrings"
    ],
    "target" : "calves"
  },
  {
    "secondaryMuscles" : [
      "triceps",
      "upper back"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wvM9JbCsStPQoh",
    "bodyPart" : "shoulders",
    "target" : "delts",
    "id" : "0766",
    "equipment" : "smith machine",
    "name" : "smith shoulder press",
    "instructions" : [
      "Adjust the seat height and position yourself on the smith machine with your feet shoulder-width apart.",
      "Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Lift the bar off the rack and position it at shoulder level, with your elbows bent and palms facing forward.",
      "Press the bar upward until your arms are fully extended overhead.",
      "Pause for a moment at the top, then slowly lower the bar back down to shoulder level.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart" : "upper legs",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "equipment" : "smith machine",
    "target" : "glutes",
    "name" : "smith squat",
    "instructions" : [
      "Set up the smith machine with the barbell at an appropriate height for your squat.",
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Position yourself under the barbell, resting it on your upper traps and shoulders.",
      "Grip the barbell with a wide grip, slightly wider than shoulder-width apart.",
      "Engage your core and unrack the barbell, stepping back to clear the rack.",
      "Keeping your chest up and back straight, initiate the squat by bending at the hips and knees.",
      "Lower your body until your thighs are parallel to the ground or slightly below.",
      "Pause for a moment at the bottom, then drive through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "id" : "0770",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/bXMWMFelFzE48g"
  },
  {
    "bodyPart" : "shoulders",
    "target" : "delts",
    "id" : "0775",
    "equipment" : "smith machine",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/2bD4s0tWf0paba",
    "secondaryMuscles" : [
      "traps",
      "biceps"
    ],
    "instructions" : [
      "Stand with your feet shoulder-width apart, facing the smith machine.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Keep your back straight and your core engaged.",
      "Pull the barbell up towards your chin, leading with your elbows.",
      "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "smith upright row"
  },
  {
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "id" : "2138",
    "bodyPart" : "cardio",
    "equipment" : "stationary bike",
    "name" : "stationary bike run v. 3",
    "instructions" : [
      "Adjust the seat height and position to ensure proper alignment.",
      "Place your feet on the pedals and secure them with the straps if available.",
      "Start pedaling at a comfortable pace.",
      "Maintain a steady rhythm and increase the resistance as desired.",
      "Engage your core muscles to maintain stability and proper posture.",
      "Continue pedaling for the desired duration of your workout.",
      "Gradually decrease the resistance and slow down before coming to a complete stop.",
      "Stretch your legs and cool down after the workout."
    ],
    "target" : "cardiovascular system",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/6XA4AmGIeR-lry"
  },
  {
    "id" : "0798",
    "instructions" : [
      "Adjust the seat height and position on the stationary bike to ensure proper alignment.",
      "Place your feet on the pedals and secure them with the straps if available.",
      "Start pedaling at a comfortable pace, keeping your back straight and core engaged.",
      "Maintain a steady rhythm and increase the resistance level if desired.",
      "Continue pedaling for the desired duration of your cardio workout.",
      "Cool down by gradually reducing your pace and resistance level.",
      "Stretch your leg muscles after the workout to prevent tightness and promote recovery."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/8SyhfsqswqF5lc",
    "bodyPart" : "cardio",
    "target" : "cardiovascular system",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "name" : "stationary bike walk",
    "equipment" : "leverage machine"
  },
  {
    "secondaryMuscles" : [
      "hamstrings",
      "quadriceps",
      "lower back"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/1EqQKVNfgU-gQL",
    "id" : "0811",
    "target" : "glutes",
    "equipment" : "trap bar",
    "bodyPart" : "upper legs",
    "instructions" : [
      "Stand with your feet shoulder-width apart and the trap bar on the ground in front of you.",
      "Bend at the hips and knees to lower yourself down and grip the handles of the trap bar with an overhand grip.",
      "Keep your back straight and chest up as you begin to lift the trap bar off the ground by extending your hips and knees.",
      "As you lift, focus on driving through your heels and squeezing your glutes at the top of the movement.",
      "Lower the trap bar back down to the ground by bending at the hips and knees, keeping your back straight throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "name" : "trap bar deadlift"
  },
  {
    "instructions" : [
      "Sit on the edge of a bench or chair with your hands gripping the edge, fingers pointing forward.",
      "Slide your butt off the bench, supporting your weight with your hands.",
      "Bend your elbows and lower your body towards the ground, keeping your back close to the bench.",
      "Pause for a moment at the bottom, then push yourself back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "triceps",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/wGygDiuWZJi0kU",
    "name" : "triceps dip",
    "equipment" : "body weight",
    "bodyPart" : "upper arms",
    "id" : "0814",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ]
  },
  {
    "target" : "cardiovascular system",
    "equipment" : "leverage machine",
    "bodyPart" : "cardio",
    "id" : "3666",
    "name" : "walking on incline treadmill",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "calves"
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/rl2ctMTs4QZG08",
    "instructions" : [
      "Adjust the incline level on the treadmill to your desired intensity.",
      "Stand on the treadmill with your feet shoulder-width apart.",
      "Start walking at a comfortable pace, ensuring that you maintain proper form.",
      "Engage your core muscles and keep your back straight throughout the exercise.",
      "Continue walking on the incline treadmill for the desired duration of your cardio workout.",
      "Gradually decrease the incline and speed of the treadmill to cool down before stopping."
    ]
  },
  {
    "name" : "walking on stepmill",
    "equipment" : "stepmill machine",
    "bodyPart" : "cardio",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/gg3KBAjATCwLPr",
    "secondaryMuscles" : [
      "quadriceps",
      "hamstrings",
      "glutes",
      "calves"
    ],
    "instructions" : [
      "Adjust the stepmill machine to a comfortable level.",
      "Step onto the machine and place your hands on the handrails for support.",
      "Start walking by placing one foot on a step and then the other, alternating between legs.",
      "Maintain an upright posture and engage your core muscles.",
      "Continue walking for the desired duration or distance.",
      "Gradually increase the intensity or speed as you become more comfortable with the exercise.",
      "Remember to cool down and stretch after completing the exercise."
    ],
    "id" : "2311",
    "target" : "cardiovascular system"
  },
  {
    "name" : "weighted close grip chin-up on dip cage",
    "instructions" : [
      "Stand in front of the dip cage and grab the parallel bars with an underhand grip, hands shoulder-width apart.",
      "Hang from the bars with your arms fully extended, feet off the ground, and body straight.",
      "Engage your back muscles and pull your body up towards the bars, keeping your elbows close to your sides.",
      "Continue pulling until your chin is above the bars, then pause for a moment.",
      "Slowly lower your body back down to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "bodyPart" : "back",
    "target" : "lats",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "equipment" : "weighted",
    "id" : "2987",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/DNDZLWU0JAbEnu"
  },
  {
    "equipment" : "weighted",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/tZXVzkH226gtAr",
    "id" : "0834",
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "weighted front raise",
    "instructions" : [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with your palms facing your thighs.",
      "Keeping your arms straight, exhale and lift the dumbbells in front of you until they are at shoulder level.",
      "Pause for a moment at the top, then inhale and slowly lower the dumbbells back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "target" : "delts",
    "bodyPart" : "shoulders"
  },
  {
    "secondaryMuscles" : [
      "biceps",
      "forearms"
    ],
    "name" : "weighted pull-up",
    "target" : "lats",
    "id" : "0841",
    "bodyPart" : "back",
    "instructions" : [
      "Grab the pull-up bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Hang from the bar with your arms fully extended and your body straight.",
      "Engage your back muscles and pull your body up towards the bar, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the bar.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "equipment" : "weighted",
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/i4BpKZcFXX1E54"
  },
  {
    "instructions" : [
      "Sit on the edge of a bench or chair with your hands gripping the edge next to your hips.",
      "Slide your butt off the front of the bench with your legs extended in front of you.",
      "Keep your back close to the bench and your elbows slightly bent.",
      "Lower your body by bending your elbows until your upper arms are parallel to the floor.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "gifUrl" : "https:\/\/v2.exercisedb.io\/image\/116fC9UnSfTSJQ",
    "secondaryMuscles" : [
      "chest",
      "shoulders"
    ],
    "target" : "triceps",
    "id" : "1755",
    "name" : "weighted tricep dips",
    "equipment" : "weighted",
    "bodyPart" : "upper arms"
  }
]